[{"id":"8d6a2931-f563-4a78-807f-52db164e70d4","type":"Full Time","url":"https://jobs.github.com/positions/8d6a2931-f563-4a78-807f-52db164e70d4","created_at":"Mon May 10 11:17:09 UTC 2021","company":"anynines GmbH","company_url":"https://www.anynines.com/de/","location":"Saarbrücken","title":"Kubernetes Platform Engineer (m/f/d)","description":"\u003cp\u003e\u003cstrong\u003eWe are anynines - with offices located in Saarbrücken and in Berlin.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur office in \u003cstrong\u003eBerlin\u003c/strong\u003e is located within the \u003cstrong\u003eScaling Spaces Coworking space\u003c/strong\u003e directly next to the subway station Osloer Straße. Our \u003cstrong\u003eheadquarters\u003c/strong\u003e in \u003cstrong\u003eSaarbrücken\u003c/strong\u003e is situated at the \u003cstrong\u003eCampus der Universität des Saarlandes\u003c/strong\u003e - and is easily reachable by public transportation or by car.\u003c/p\u003e\n\u003cp\u003eWe are specialized in the \u003cstrong\u003eplanning, construction and operation of modern cloud platforms\u003c/strong\u003e as well as the \u003cstrong\u003eautomation of databases and data services\u003c/strong\u003e - and work with cloud technologies such as \u003cstrong\u003eKubernetes\u003c/strong\u003e and \u003cstrong\u003eCloud Foundry\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eThe development of \u003cstrong\u003ecloud-native web applications with Ruby on Rails \u0026amp; JavaScript\u003c/strong\u003e as well as the \u003cstrong\u003ecloud hosting of web applications\u003c/strong\u003e completes our portfolio, with which we support national and international companies in their digital transformation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout this job\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur modular framework of \u003cstrong\u003ea9s Platform products\u003c/strong\u003e is used by many different innovative companies around the world to build and operate comprehensive cloud-native Application Development Platforms that are used by thousands of application developers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe are looking for talented software engineers to help us drive forward the evolution of our a9s Platform in the Kubernetes Ecosystem.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will be working on the definition, design and implementation of our new Kubernetes-native products for platform woperators and application developers. These products are located in the field of Kubernetes-native Application Development Platforms and will provide a high degree of automation of complex operational tasks related to managing the complete lifecycle of applications, data services and/or entire platform stacks.\u003c/p\u003e\n\u003cp\u003eThis encompasses for example to robustly automate the entire lifecycle management (provisioning, deprovisioning, scale up/down) of data services (e.g. PostgreSQL, Redis, etc.) and / or complete Kubernetes stacks for application development  platforms.\u003c/p\u003e\n\u003cp\u003eAs we are building new products for Kubernetes, you’ll have the opportunity to contribute to it right from the beginning. Moreover, you’ll be able to bring in your own ideas when it comes to shaping the product visions and making our new products a success. Thereby, you’ll drive architectural and design decisions at a high-level and then gradually zoom in, from coding PoCs to assess your ideas to writing production-grade code.\u003c/p\u003e\n\u003cp\u003eIf you think these are cool projects and what you’ve just read excites you, don’t hesitate to apply for this job, we look forward to hearing from you! Feel free to do that even if you match only part of the qualifications.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour core tasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTogether with our experts from both the anynines operations and automation team you’ll transform human operational knowledge in the context of Kubernetes-native Application Development Platforms into sophisticated automation solutions. Your main tasks will be:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and design our new products for Kubernetes, taking into account the requirements formulated by the Product Owner as well as enterprise readiness criteria such as security, scalability, high-availability.\u003c/li\u003e\n\u003cli\u003ePerform research and experiments to explore and evaluate design options that will set the direction for the implementation.\u003c/li\u003e\n\u003cli\u003eDesign user interfaces (APIs, CLIs, GUIs) that abstract away complex operational tasks for different end user types such as application developers and platform operators.\u003c/li\u003e\n\u003cli\u003eCode, together with our development team, both MVPs / PoCs as well as production-grade software that implements your solution design.\u003c/li\u003e\n\u003cli\u003eParticipate in code reviews and test-driven development.\u003c/li\u003e\n\u003cli\u003eArchitect and develop, together with our team, support infrastructure such as CI/CD pipeline, testing environment.\u003c/li\u003e\n\u003cli\u003eActively participate in workshops, conferences and meetups such as KubeCon or CNCF Meetups to present and discuss your innovative design and implementation approaches with the community.\u003c/li\u003e\n\u003cli\u003eProduce content such as technical blog posts or youtube videos featuring your own research, design and development to let the community know about the product(s) you’re working on.\u003c/li\u003e\n\u003cli\u003ePerform PoCs to customers and train them to use our product.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we expect\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent knowledge of Kubernetes and/or other CNCF projects. Bonus points if you’ve written a custom Kubernetes controller, you know the internals of Kubernetes or you’ve done open-source contributions to a CNCF project.\u003c/li\u003e\n\u003cli\u003eGood understanding of cloud native application architectures and cloud-concepts like high availability, scalability, etc.\u003c/li\u003e\n\u003cli\u003eKnowledge of containerization technologies, in particular container images and their life-cycle including multi-stage builds, registries, etc.\u003c/li\u003e\n\u003cli\u003eKnowledge of common software design and architectural patterns and the ability to design and document complex software solutions.\u003c/li\u003e\n\u003cli\u003eUnderstanding and experience of CI/CD tools such as Concourse or Jenkins.\u003c/li\u003e\n\u003cli\u003eExperience with Git and related version control workflows.\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of the Go Programming Language and the Operator Framework, or ability and willingness to learn them in depth (as well as other languages and frameworks if the need arises).\u003c/li\u003e\n\u003cli\u003eExperience in deploying and managing Kubernetes Clusters and complete Kubernetes Stacks , e.g. with automation tools like Cluster API.\u003c/li\u003e\n\u003cli\u003eKnowledge and hands-on experience with IaaS platforms such as Amazon Web Services.\u003c/li\u003e\n\u003cli\u003eKnowledge of one or more data services such as PostgreSQL, Redis, and others.\u003c/li\u003e\n\u003cli\u003eGood written and oral communication skills in English.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you can contribute\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eSeveral years of professional experience as developer / in computer science in a similar IT environment\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePractical experience in the application of agile methods such as Scrum and Kanban as well as the confident use of Scrum-specific tools (we use Jira)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHigh motivation, interest and commitment, especially with regard to own growth and thus strengthening the team\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGood communication and presentation skills as well as a distinctive ability to work in a team\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong strategic and analytical thinking paired with the ability for a good prioritization and self-organization of your own tasks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eHelp us to drive the growth of the team and of our product!\u003c/strong\u003e -\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we are offering\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFlexibility:\u003c/strong\u003e You can choose your individual workplace and organize your flexible work time. Including working remotely from home.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFurther Training:\u003c/strong\u003e You can choose further training offers - according to tasks or for soft-skills. For example German or English training in small groups during your work time or visit conferences and meetups of your choice, in order to extend your knowledge and broaden your network. You can also contribute to and gain knowledge from our internal knowledge platform (anynines Learn).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFamily and Professional Life:\u003c/strong\u003e Profit from our family friendly and family like atmosphere. We also give the opportunity to work part-time, let us know if that’s what you wish during the recruiting process.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWork Surroundings:\u003c/strong\u003e A remarkably innovative enterprise growing sustainably in a dynamic market, a company that has maintained its agile startup spirit. We foster and appreciate independent and free thinking.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/3c0ee4164076a062ce3360f2efe40fc681c9f548/68747470733a2f2f742e676f686972696e672e636f6d2f682f38393863396564646434613963653532316263303739346535636233396535663266633638653963613064393666316633393132626637623662316161313931\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/131510eb4fd2a4ae1f50a0b720124de80956aa0df3b802989e9994d377f79af6\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjJpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c0de8e40807c0e2a94cba6ea62db092bc0393264/anynines%20GmbH.png"},{"id":"97ead246-d95f-45b0-886a-4391721fb114","type":"Full Time","url":"https://jobs.github.com/positions/97ead246-d95f-45b0-886a-4391721fb114","created_at":"Mon May 03 15:24:53 UTC 2021","company":"European IT Consultancy EITCO GmbH","company_url":"https://www.eitco.de/","location":"Bonn","title":"DevOps Engineer (m/w/d)","description":"\u003cp\u003eWir bei EITCO entwickeln IT-Lösungen, die Arbeitsabläufe und Geschäftsprozesse intelligent und wirksam verbessern.\u003c/p\u003e\n\u003cp\u003eDie Zufriedenheit unserer Kunden und Partner steht bei EITCO ebenso im Mittelpunkt wie das Wohlbefinden unserer Mitarbeiter.\u003c/p\u003e\n\u003cp\u003eAls mittelständisches Dienstleistungsunternehmen sind wir stolz auf unsere flache Hierarchie, die flexiblen Arbeitsbedingungen sowie unsere wertschätzende und familiäre Atmosphäre.\u003c/p\u003e\n\u003cp\u003eDies ist die Basis unserer Leistungsfähigkeit, mit der wir seit vielen Jahren erfolgreich am Markt sind.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.eitco.de\"\u003ehttps://www.eitco.de\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWir suchen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFür unser Application Management Team suchen wir ab sofort einen DevOps Engineer (m/w/d) für Systemintegration zur Festanstellung in Vollzeit, der die Schnittstelle zwischen Systemtechnik, Anwendungsentwicklung und Fachabteilung bildet.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDeine Position\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBetreuung der Anwendung im Betrieb\u003c/li\u003e\n\u003cli\u003eVerantwortung für den Applikationsbetrieb, u.a. Überwachung Installationen und Fortführung\u003c/li\u003e\n\u003cli\u003eAnpassung des Servicedesigns des Verfahrens, z.B. bei Änderung der Parameter sowie Anpassungen der Architektur\u003c/li\u003e\n\u003cli\u003eVerantwortung für den Betrieb der Anwendung\u003c/li\u003e\n\u003cli\u003eSteuerung des Rollouts von Releases\u003c/li\u003e\n\u003cli\u003eBewertung von Changes, z.B. die technische Umsetzung von fachlichen Änderungen bei der Entwicklung und deren Auswirkung auf den Applikationsbetrieb\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eUnsere Technologien\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLinux (SLES, CentOS, Ubuntu)\u003c/li\u003e\n\u003cli\u003eAutomatisierung / Konfigurationsmanagement (Puppet)\u003c/li\u003e\n\u003cli\u003eVersionsverwaltung (git)\u003c/li\u003e\n\u003cli\u003eSkriptsprachen (bash, ruby, powershell)\u003c/li\u003e\n\u003cli\u003eJava-Applicationserver (Tomcat)\u003c/li\u003e\n\u003cli\u003eMessage Broker (Apache ActiveMQ)\u003c/li\u003e\n\u003cli\u003eRDBMS (PostgreSQL, MariaDB/MySQL, MS SQL)\u003c/li\u003e\n\u003cli\u003eMonitoring (Nagios, Prometheus)\u003c/li\u003e\n\u003cli\u003eESB (Apache Karaf / Camel)\u003c/li\u003e\n\u003cli\u003eVirtualisierung (Virtualbox / vagrant, VmWare)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDein Profil\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu bist vertraut mit Open Source Projekten und der Linux-Welt\u003c/li\u003e\n\u003cli\u003eEin sicherer Umgang mit Apache Tomcat und diverser Middleware ist für dich kein Problem\u003c/li\u003e\n\u003cli\u003eideal: Betreuung verteilter Systeme\u003c/li\u003e\n\u003cli\u003eideal: Du hast Puppet-Kenntnisse\u003c/li\u003e\n\u003cli\u003eTeamgeist und Kommunikationsbereitschaft ist für dich selbstverständlich\u003c/li\u003e\n\u003cli\u003eMindestens 1-2 Jahre Berufserfahrung oder Berufs-/ Quereinstieg\u003c/li\u003e\n\u003cli\u003eDeutsch auf muttersprachlichem Niveau und gute Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWarum wir?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(Familien-) Freundliche Arbeitsatmosphäre\u003c/li\u003e\n\u003cli\u003eFlache Hierachien und kurze Entscheidungswege\u003c/li\u003e\n\u003cli\u003eWeiterbildungsmöglichkeiten\u003c/li\u003e\n\u003cli\u003eCommunity of Practice\u003c/li\u003e\n\u003cli\u003eMonatlicher OpenFriday mit Beiträgen aller Mitarbeitenden\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten mit Gleitzeit\u003c/li\u003e\n\u003cli\u003e30 Tage Urlaub\u003c/li\u003e\n\u003cli\u003eBetriebliches Gesundheitsmanagement mit Betriebssport, Fitnessstudios und Leasingfahrrädern\u003c/li\u003e\n\u003cli\u003eMitarbeiterbenefits\u003c/li\u003e\n\u003cli\u003eEinarbeitung mit eigenem Paten\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eKontakt\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDeine Ansprechpartnerin:\u003c/p\u003e\n\u003cp\u003eMeike Bodemann, HR Manager/Management Assistent\nEuropean IT Consultancy EITCO GmbH\nFon +49 (228) 338 881 150\u003c/p\u003e\n\u003cp\u003eStandorte:\nBerlin, Potsdamer Platz 10, 10785 Berlin\nBonn, Am Bonner Bogen 6, 53227 Bonn\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/ad85f3b158046ea552723b2582c965af672b09a8/68747470733a2f2f742e676f686972696e672e636f6d2f682f61323863333636643863663666626265353439386133356333666333343834323938383266323330376537666461393230323334303636393632306361393434\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/3bb41fdbb4899f3f9329057770fc8f026107a43412590e6918d303484e3d4ef0\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1dpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--379ae72ab212eb27d8ba70803b487b0bd0ca3e34/European%20IT%20Consultancy%20EITCO%20GmbH.png"},{"id":"421871bb-05d3-4fbe-b00c-3f372fa35584","type":"Full Time","url":"https://jobs.github.com/positions/421871bb-05d3-4fbe-b00c-3f372fa35584","created_at":"Tue Aug 04 17:23:12 UTC 2020","company":"Sticker Mule","company_url":"https://www.stickermule.com/careers","location":"Anywhere","title":"Javascript Engineer","description":"\u003cp\u003e\u003cstrong\u003eAbout Sticker Mule\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a  globally distributed team who cares deeply about delivering a great customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.\u003c/p\u003e\n\u003cp\u003eThe Software team is responsible for building and maintaining our front-end and back-end services, developing new features and products, and troubleshooting problems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.stickermule.com/about\"\u003eSee more about our teams here\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eRemote work with flexible schedules\u003c/li\u003e\n\u003cli\u003eVaried, interesting technical challenges to solve\u003c/li\u003e\n\u003cli\u003eA fun \"no bullshit\" work environment\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eWe like you to know\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eNextJS\u003c/li\u003e\n\u003cli\u003eReact\u003c/li\u003e\n\u003cli\u003eNodeJS\u003c/li\u003e\n\u003cli\u003eGraphQL\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003eRedis\u003c/li\u003e\n\u003cli\u003eFamiliarity with Ruby\u003c/li\u003e\n\u003cli\u003eExcellent communication skills (English)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent practical experience\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eChallenges\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eImprove and expand our React shared components gallery\u003c/li\u003e\n\u003cli\u003eMigrate a large Rails code base to JavaScript front-ends and back-ends\u003c/li\u003e\n\u003cli\u003eMaintain optimal front-end performance on desktop and mobile\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation and benefits\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e$99,000-$135,000+\u003c/li\u003e\n\u003cli\u003e$10,000 signing bonus\u003c/li\u003e\n\u003cli\u003e4 weeks vacation\u003c/li\u003e\n\u003c/ol\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eApply here only:\u003c/strong\u003e \u003ca href=\"https://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29\"\u003ehttps://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3VIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--04344d944b21465d33ecd7bd62098692640a8658/herman%206.jpg"},{"id":"7e95bae3-1a81-40e8-b254-c73db01770ae","type":"Full Time","url":"https://jobs.github.com/positions/7e95bae3-1a81-40e8-b254-c73db01770ae","created_at":"Fri Apr 30 19:14:11 UTC 2021","company":"Bonanza.com, Inc.","company_url":"http://www.bonanza.com","location":"Seattle, WA","title":"Senior Rails Developer","description":"\u003cp\u003eWe're looking for a full-time, full-stack Ruby on Rails developer to help us tackle the many challenges of running a marketplace that scales.\u003c/p\u003e\n\u003cp\u003eAs the sole developer working on the marketplace side of the business, you will play a critical role through every project’s lifecycle from design to development to maintenance. You'll collaborate closely with key stakeholders throughout the process to ensure success of the final outcome. Seasoned developers will review code before implementation to provide necessary feedback and guidance. Some of the stuff we're working on includes:\u003c/p\u003e\n\u003cp\u003eAPI: enable sellers and third parties to sell on Bonanza\u003c/p\u003e\n\u003cp\u003eImporters: allow sellers to effortlessly bring inventory from platforms including eBay, Shopify, and CSV\u003c/p\u003e\n\u003cp\u003eBroadcaster: an advertising platform that takes Google Adwords and makes it comprehensible\u003c/p\u003e\n\u003cp\u003eFraud and compliance: keeping disallowed items and bad actors off the platform\nMobile-first UX\u003c/p\u003e\n\u003cp\u003eThird party integrations (checkout, dispute management, OAuth signup and login)\u003c/p\u003e\n\u003cp\u003eObviously these bullets only scratch the surface of the tasks we'll be working on at a given time. You will also have opportunities to research and integrate new technologies.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Requirements\u003c/strong\u003e\nA minimum of 3 years of Ruby on Rails experience in a production environment. You'll be working in the full stack, from the database (MySQL) up to jQuery and HTML/CSS. You should have the doggedness to solve problems through documentation, research, and reviewing logs and past commits. You should have the empathy to see problems from our customers’ shoes and keep their needs in mind while building solutions.\u003c/p\u003e\n\u003cp\u003eWe are a data driven company from the business level down to individual contributors, so we experiment with different methods to evaluate success. We are looking for developers who can come up to speed on new skills and technologies, turn that into a regular cadence of completed work, and who have time management skills to get through all their tasks coding or otherwise.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Benefits\u003c/strong\u003e\nWatch: \u003ca href=\"https://www.youtube.com/watch?v=ggA3-odI-Ls\"\u003eWhat's it like to work at Bonanza?\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eBonanza is a product-first company run by a CEO who has spent most of his adult life as a Programmer. The implications of this are that we've obsessed for literally years about how to foster an environment optimized for Developer happiness and throughput. It starts with our salaries, which, at the high end, range to levels beyond those offered by the tech titans. More importantly, we provide a working environment where you will virtually never be interrupted by meetings, and where you will be given access to the best hardware available. Because your productivity should never constrained for lack of resources. We also offer a thoughtfully constructed collection of perks that stands apart from our competitors:\u003c/p\u003e\n\u003cp\u003eProfitable company that recently celebrated its 13 year anniversary.\u003c/p\u003e\n\u003cp\u003eHybrid remote/office model. We're working remotely due to the pandemic and will switch to a hybrid model with Tuesdays \u0026amp; Fridays in the office for meetings and catered lunches with the team.\u003c/p\u003e\n\u003cp\u003e\"Freedom February\" - every February we retreat from Seattle and spend a month annoying our friends with selfies taken in Mexico, Belize, Europe, etc.\u003c/p\u003e\n\u003cp\u003eFive bonus (not counted as vacation) days off in February to enjoy your vacation or staycation.\u003c/p\u003e\n\u003cp\u003eTwice-weekly catered lunches.\u003c/p\u003e\n\u003cp\u003eProfessional development opportunities.\u003c/p\u003e\n\u003cp\u003eWork from a waterfront office in downtown Seattle (food trucks aplenty!) convenient to many bus lines.\u003c/p\u003e\n\u003cp\u003eBreak room with ping pong, MAME cabinet, and coworker led office yoga.\u003c/p\u003e\n\u003cp\u003eThe boring stuff: fully paid health insurance coverage, holidays, stock options, and more.\u003c/p\u003e\n\u003cp\u003eBeyond this set of perks, we are committed to inclusion and enabling everyone to be heard. We also commit to our employees that if ever they have ideas on how we can improve our benefits package to better serve our team, we will do our best to make them happen.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply through our website at \u003ca href=\"https://www.bonanza.com/jobs/18\"\u003ehttps://www.bonanza.com/jobs/18\u003c/a\u003e or by emailing \u003ca href=\"mailto:jobs@bonanza.com\"\u003ejobs@bonanza.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXlpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8c12840bb800d886f0ce1a0213ea27b68e17cf61/bonz_green_square.png"},{"id":"8c35f2eb-7f9b-4c3d-8b9b-afbd3bb73fd4","type":"Full Time","url":"https://jobs.github.com/positions/8c35f2eb-7f9b-4c3d-8b9b-afbd3bb73fd4","created_at":"Tue Apr 27 21:48:01 UTC 2021","company":"Vista Higher Learning","company_url":null,"location":"Boston, MA, USA","title":"Senior Software Engineer","description":"\u003cp\u003eWe’re life-long learners, creative thinkers, technology enthusiasts and innovators redefining the way world languages are learned and taught in interactive and intuitive environments. We love what we do and we’re proud of the customer-facing products we create! Our industry leading platform and millions of users are a testament to the passion and commitment we bring to developing the best online learning experience for language education!  If you share that passion for being the best, we want to talk! Our ideal candidate looks for creative solutions, is continually learning, and loves to develop best-in-class solutions to complex technical challenges.\u003c/p\u003e\n\u003cp\u003eWe’re looking for an experienced Senior Software Engineer with strong Ruby on Rails knowledge and experience in AWS or other cloud-based deployments.  You will participate in all aspects of the development lifecycle – from project planning \u0026amp; design, to implementation and release.  We are a highly collaborative team that prizes those looking not just to deliver projects, but do so with fun and in continually better ways.\u003c/p\u003e\n\u003cp\u003eOur technology stack:\u003c/p\u003e\n\u003cp\u003eLanguages/Frameworks: Ruby/Rails, JS, Vue\nPersistence: MySQL, Postgres, Redis, ElasticSearch\nAutomation: Chef, Cloudformation\nHosting: AWS\u003c/p\u003e\n\u003cp\u003eWhat you bring to the party:\u003c/p\u003e\n\u003cp\u003eBA/ BS in computer science or other related field or equivalent experience\n7+ years engineering experience developing large-scale systems\nExperience in ed-tech or education fields, a strong plus\nExperience building and deploying high-capacity applications in cloud environments (AWS or GCP)\nStrong command of Ruby on Rails, Java, or Python\nExperience with SQL, Postgres, Redis, Elasticsearch, CodeBuild \u0026amp; CodeDeploy, Git / Github\nExperience with Linux (especially Ubuntu/ Debian)\nAbility to work well with geographically distributed teams as well as highly collaborative environments\nAbility to execute on projects with fast deadlines.  Comfortable with ambiguity, and flexible in pitching in.\nExcellent communication and interpersonal skills\nSome proficiency in Spanish is a strong plus\u003c/p\u003e\n\u003cp\u003eWhy join us?  We at Vista Higher Learning are proud to say that we’re not just another publisher. We’re the leading specialized language publisher for U.S. and Canadian higher education and secondary school markets whose first-hand knowledge of languages and diverse cultures sets us apart from other publishers.  We’re passionate about developing educational materials that incorporate authenticity and culture. We bring a fresh new approach to teaching languages by integrating technology, design, content, and pedagogy to make learning easier, more practical, and more rewarding. With current programs in Spanish, French, Italian and German Vista Higher Learning is committed to helping people communicate across languages and cultures.\u003c/p\u003e\n\u003cp\u003eVista Higher Learning is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, age, color, religion, sexual orientation, gender identity, national origin, physical or mental disability, and/or protected veteran status or other characteristics protected by applicable law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vistahigherlearning.applytojob.com/apply/Tj8yvvUj6H/Senior-Software-Engineer?source=GitHub\"\u003ehttps://vistahigherlearning.applytojob.com/apply/Tj8yvvUj6H/Senior-Software-Engineer?source=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDZpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fe7f469e66f2c1e1811cbf7ab809c29c18998d89/Corporate%20Logo.png"},{"id":"98b06bf7-df44-4c18-937f-bbb68116398b","type":"Full Time","url":"https://jobs.github.com/positions/98b06bf7-df44-4c18-937f-bbb68116398b","created_at":"Mon Apr 26 16:03:55 UTC 2021","company":"lawpilots GmbH","company_url":"https://www.lawpilots.com/de-de/","location":"Berlin","title":"Software Developer (Backend / Infrastructure) (m/w/d)","description":"\u003cp\u003e\u003cstrong\u003eIntro\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJoin us in Berlin\u003c/p\u003e\n\u003cp\u003eAt lawpilots, we create digital learning that people love. E-learning is one of the growth markets of the future - even more so during the current crisis.\u003c/p\u003e\n\u003cp\u003eWe are looking for a developer to help us improve our current e-learning solution, build new features, increase the user experience and maintain high standards in terms of our technical setup. We are looking to improve our CI/CD pipeline, improve observability and monitoring and continuously strive to automate what is reasonable to be automated. We work and make decisions together and address mistakes as a chance to learn and improve.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHelp maintain and extend our current learning platform\u003c/li\u003e\n\u003cli\u003eParticipate in the design, development and maintenance of new systems and components\u003c/li\u003e\n\u003cli\u003eAutomate our internal and public-facing infrastructure\u003c/li\u003e\n\u003cli\u003eDocument our system landscape, including decision documents and overview diagrams\u003c/li\u003e\n\u003cli\u003eImplement reliable logging and monitoring solutions\u003c/li\u003e\n\u003cli\u003eEnsure security and data compliance throughout our services\u003c/li\u003e\n\u003cli\u003eHelp customers, both prospective and current, to make the best use of our platform by contributing to the user experience\u003c/li\u003e\n\u003cli\u003eWork with our customer success and sales teams to help them onboard and support  customers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s Degree in Computer Science, Software Engineering, Computer Engineering or demonstrable similar experience\u003c/li\u003e\n\u003cli\u003eStrong English language skills, written as well as oral\u003c/li\u003e\n\u003cli\u003e2+ years of working experience as a service reliability engineer, platform engineer, backend engineer, or similar\u003c/li\u003e\n\u003cli\u003eVery good understanding of Linux server administration, networking, distributed systems, security best practices\u003c/li\u003e\n\u003cli\u003eExperience with log and metric collection\u003c/li\u003e\n\u003cli\u003eExperience with automation (Infrastructure as Code, Configuration Management)\u003c/li\u003e\n\u003cli\u003eExperience with networking, distributed systems and cloud technology\u003c/li\u003e\n\u003cli\u003eExperience or willingness to learn how to design, develop, test and maintain web applications and associated services (for instance with Python, Go or Ruby)\u003c/li\u003e\n\u003cli\u003eAbility to work independently, as well as an effective part of the team\u003c/li\u003e\n\u003cli\u003eAny lack of experience in the above can be compensated by a great attitude towards continuous learning and self-improvement\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy us?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhy us?\nWe take care of our employees and provide you with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFlexible working hours with the option to work partially remote (fully remote during the pandemic)\u003c/li\u003e\n\u003cli\u003eModern computer and huge 4k screens\u003c/li\u003e\n\u003cli\u003eA diverse and international environment\u003c/li\u003e\n\u003cli\u003eA modern workplace close to the Berlin central station\u003c/li\u003e\n\u003cli\u003eSpecial employee offers for sports clubs, gadgets, fashion, ....\u003c/li\u003e\n\u003cli\u003eAnd a lot of fun :)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur interview process\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFirst video call: 1 hour with our IT Team Lead and one backend developer\u003c/li\u003e\n\u003cli\u003eA home assignment which can be done within 1 hour\u003c/li\u003e\n\u003cli\u003eA follow-up video call with a chance to discuss your approach and to meet more of the team\u003c/li\u003e\n\u003cli\u003eA video call with our COO\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking forward to seeing you!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/8a7877a43fa91801f1ccdcd63e790769117b8afd/68747470733a2f2f742e676f686972696e672e636f6d2f682f31666161363462633661326430373462313733633630306430313731643762313435343832363632363963663537616537346131376463646130306536323761\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/7f427001480f1cae28d00b35f2e9bd0924e559b9879c933610c9a4cd3ebdb650\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEdpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7c379bf64f1fce3dcdbe3bfc67c21a521ab048b7/lawpilots%20GmbH.png"},{"id":"d0afa0c1-2ff5-4bb4-acc6-911eb06a2013","type":"Contract","url":"https://jobs.github.com/positions/d0afa0c1-2ff5-4bb4-acc6-911eb06a2013","created_at":"Mon Apr 26 15:33:08 UTC 2021","company":"Fullstack","company_url":"http:","location":"Anywhere","title":"React Native Engineer","description":"\u003cp\u003e\u003cstrong\u003eReact Native Mobile Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFullstack is looking for a motivated full-stack mobile engineer who will help develop and contribute to world class applications and products. You will have the opportunity to work on all aspects of our mobile application stack, from mobile app development in react native to backend api development in Ruby on Rails.  You will be joining a close knit group of very talented designers, engineers, and product managers that have a great time building software that makes a difference.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePrimary Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDrive development of our mobile applications, from architecture, to coding, to release.\u003c/li\u003e\n\u003cli\u003eTake ownership in developing and improving all aspects of our stack (development, testing, CI, automation, and architecture)\u003c/li\u003e\n\u003cli\u003eRelease to both iOS and Android (Apple App Store, Google Play Store)\u003c/li\u003e\n\u003cli\u003eAssist in development and maintenance of web-based backend API services\u003c/li\u003e\n\u003cli\u003eDesigning and engineering features that deliver value to the people who use them.\u003c/li\u003e\n\u003cli\u003eCollaborating closely with the entire team (designers, product managers, etc.)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout FullStack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur mission is to make our clients incredibly successful by developing and improving ideas into highly functional and usable web applications. Our team has become renowned in our ability to bring creativity, expertise, and sound development practices to notable and ambitious startups. Our development work focuses on architecting and building new applications as well as scaling existing apps for our clients as they grow.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLet’s Have A Chat If You…\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave developed React Native apps that communicate with Restful APIs, network data synchronization, and user authentication.\u003c/li\u003e\n\u003cli\u003eHave a working knowledge of the Expo platform for React Native.\u003c/li\u003e\n\u003cli\u003eUnderstand and have experience making decisions about mobile application architecture, including data modeling, networking and data synchronization, and concurrency.\u003c/li\u003e\n\u003cli\u003eAre self-directed and able to manage your time effectively\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus points for…\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBeing experienced working in Ruby, and knowing your way around the Rails framework.\u003c/li\u003e\n\u003cli\u003eiOS or Android development experience using Objective-C, Swift, or Android\u003c/li\u003e\n\u003cli\u003eExperience working with high availability server architectures in AWS.\u003c/li\u003e\n\u003cli\u003eKnowing your way around XCode or Android Studio\u003c/li\u003e\n\u003cli\u003ePrevious history of working with a remote, distributed team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOther information about this position\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking remotely is how we operate\u003c/li\u003e\n\u003cli\u003eThis is a per-project, contract position, with up to 40 hours per week\u003c/li\u003e\n\u003cli\u003eWe are looking for people located within the 4 US time zones.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eComplete the online application at \u003ca href=\"https://gofullstack.com/job-application/\"\u003ehttps://gofullstack.com/job-application/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZytpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b2e8d8a94d87e84139c2b8ba7cbc54469019ee29/fullstack-logo-mark.png"},{"id":"33fa9582-fbd3-4735-b1f2-dd9d978e2549","type":"Full Time","url":"https://jobs.github.com/positions/33fa9582-fbd3-4735-b1f2-dd9d978e2549","created_at":"Sun Apr 25 04:44:57 UTC 2021","company":"DevStar Jobs","company_url":"https://devstarjobs.com","location":"Nashville, TN","title":"Senior Engineer Ruby on Rails","description":"\u003cp\u003eBe part of a great team building the next generation hiring platform for software development jobs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCollaborate with team members to solve challenging engineering problems\u003c/li\u003e\n\u003cli\u003eBuild customer-first solutions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour contributions?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBroad web development experience with Ruby and Rails\u003c/li\u003e\n\u003cli\u003eCrisp communication\u003c/li\u003e\n\u003cli\u003eFocus on project adaptability and manageability at the architecture level\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy apply?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork on a small, agile (lowercase agile!) team without administrative overhead\u003c/li\u003e\n\u003cli\u003eRemote first, flexibility for Life – because it happens\u003c/li\u003e\n\u003cli\u003eHelp fellow software developers by connecting them with hiring companies with a simple, straightforward process, without all the hassle of spammy notifications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eDiversity and equal opportunity are important to us. We are happy about the interest of all candidates and strive to provide feedback as quickly as possible.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail CV and GitHub username to \u003ca href=\"mailto:devstarjobs@protonmail.com\"\u003edevstarjobs@protonmail.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"b0f36645-4759-474a-b25e-9fa5d28cf595","type":"Full Time","url":"https://jobs.github.com/positions/b0f36645-4759-474a-b25e-9fa5d28cf595","created_at":"Fri Apr 23 11:53:03 UTC 2021","company":"Livestorm","company_url":"https://livestorm.co/","location":"full remote","title":"Back-End Engineer Ruby - Integrations Squad","description":"\u003cp\u003eAbout Livestorm:\u003c/p\u003e\n\u003cp\u003eLivestorm is the all-in-one video communication platform for companies looking to implement a powerful video communication strategy.\u003c/p\u003e\n\u003cp\u003eFounded in 2016, Livestorm enables companies to promote, host and analyze their online events. We’re building the future of unified video communication: an all-in-one video communication platform that connects to your tools and lives in your browser. Livestorm is a browser-based platform that doesn’t require a download, or setup. You can use Livestorm for on-demand, live, or pre-recorded meetings or events.\u003c/p\u003e\n\u003cp\u003eLivestorm has been built with ease-of-use in mind.\u003c/p\u003e\n\u003cp\u003eWe serve companies of all sizes, from startups to Fortune500. Front, Honda, Intercom or Spendesk trust Livestorm to organize their meetings, webinars or online events.\u003c/p\u003e\n\u003cp\u003eHere are our core values:\u003c/p\u003e\n\u003cp\u003eStay curious: Be interested in the world around you.\nRemain humble: Keep learning and keep your ego in check.\nBe resourceful: Go that extra mile in the most efficient way.\nOwn it: Take pride in what you do, own your wins, and fails.\nBe transparent: Sharing knowledge, learnings, feedback, and mistakes.\u003c/p\u003e\n\u003cp\u003eTeam description:\nAs Livestorm is growing rapidly, our Team is aiming to develop our public API and everything that has to do with relevant data synchronisation between Livestorm and 2nd/3rd-party softwares. Therefore, we are looking for a talented Back-End Engineer that can be a partner in helping us scale up our integrations ecosystem and make sure Livestorm can be connected with all relevant softwares in the industry.\u003c/p\u003e\n\u003cp\u003eWhile Livestorm has headquarters in Paris, we are a remote-first company. As a matter of fact, Stormies are located between France, Germany, Greece, Mauritius, Spain, USA,... so we are looking for the best talent, no matter where you live.\u003c/p\u003e\n\u003cp\u003eMissions:\u003c/p\u003e\n\u003cp\u003eIn this role, you will be responsible of:\u003c/p\u003e\n\u003cp\u003eDesigning, building and maintaining features in production\nParticipating in Code Reviews and providing feedback to Team Members\nSharing knowledge with everyone and helping your Team to grow\nHaving the freedom to experiment\nContributing to architectural and design decisions\nMonitoring the production to try to prevent any issue that could impact our customer experience\u003c/p\u003e\n\u003cp\u003eCurrent Stack:\u003c/p\u003e\n\u003cp\u003eBackend: Ruby 2.7.1 (soon Ruby 3), Rails 6, NodeJS 12.20.1, Apollo Server\nDatastores: PostgreSQL / Redis\nFrontend: Vue.js\nInfra: AWS\nMore on Stackshare 👉 \u003ca href=\"https://stackshare.io/livestorm/livestorm\"\u003ehttps://stackshare.io/livestorm/livestorm\u003c/a\u003e\nPré-requis du poste\nFor this Backend Engineer Ruby - Integrations Squad role, we are looking for someone with the following experience:\u003c/p\u003e\n\u003cp\u003eCode:\u003c/p\u003e\n\u003cp\u003eAt least 3 years experience in Ruby and Rails (Rails 5+)\nPrevious experience with public API\nRigorous about testing and code quality (TDD, acceptance tests, unit tests)\nTeam fit:\u003c/p\u003e\n\u003cp\u003eYou're a team player and you have a sense of ownership.\nYou can speak / write in English (French is a plus).\nPlus:\u003c/p\u003e\n\u003cp\u003eInterested by micro-services oriented architectures\nYou know how to implement event-based communication between micro-services.\nYou have already worked in an agile environment and you loved it.\nYou are curious about new languages and aren't afraid of using new patterns and structures.\nMoreover, we are looking for someone who can work in the Paris timezone (we accept a jet-lag of 2 hours maximum).\u003c/p\u003e\n\u003cp\u003eConfidence can sometimes hold us back from applying for a job. But we'll let you in on a secret: there's no such thing as a 'perfect' candidate. So however you identify and whatever background you bring with you, please apply if this is a role that would make you excited to come into work every day.\u003c/p\u003e\n\u003cp\u003eWhat it is like to join Livestorm and the Stormies:\u003c/p\u003e\n\u003cp\u003e🗺 Work from anywhere you want:\u003c/p\u003e\n\u003cp\u003e🏡 Home (participation for equipment and costs, according to our expense policy)\n🏢 Paris office (snacks, drinks, afterworks...)\n💼 Coworking space (covered up to €300 including VAT per month, or local currency equivalent)\n🚉 Business trips are covered (according to our internal T\u0026amp;E policies)\n🚲 Sustainable mobility package for daily trips to go to work\n🎉 Cheer up your Stormie life:\u003c/p\u003e\n\u003cp\u003e🎿 Off-sites twice a year\n🕹 Weekly activities (online board games, riddles...)\n👐 Teambuildings\n🗣 Monthly Talking times\n💙 Take care of yourself (with Moka.care)\u003c/p\u003e\n\u003cp\u003e🤝 Participate to our referral program\u003c/p\u003e\n\u003cp\u003e👶 Livestorm signed the \"Parental act\"\u003c/p\u003e\n\u003cp\u003eAnd also, benefit from:\u003c/p\u003e\n\u003cp\u003e🌍 All legal and mandatory benefits from your work country for EOR contracts.\u003c/p\u003e\n\u003cp\u003e🇫🇷 All French legal benefits for French contracts: €9 of lunch vouchers with Swile (covered at 50%), health insurance with Alan (covered at 50%), transport subscription to go to work (covered at 50%), and CSE with cultural \u0026amp; sport activities via Leeto.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply on \u003ca href=\"https://jobs.livestorm.co/o/backend-engineer-ruby-integrations-squad/c/new\"\u003ehttps://jobs.livestorm.co/o/backend-engineer-ruby-integrations-squad/c/new\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnVoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ae48e3770ef8ca5c0c1a0dc4ff1808041cd802be/logo-site-livestorm-presta.jpeg"},{"id":"c4805a8e-97de-4b35-b1dd-cf251ba327aa","type":"Full Time","url":"https://jobs.github.com/positions/c4805a8e-97de-4b35-b1dd-cf251ba327aa","created_at":"Tue Apr 20 15:59:37 UTC 2021","company":"Literally Media","company_url":"https://literally.media","location":"Remote","title":"Full Stack - Ruby on Rails Developer","description":"\u003cp\u003eAbout the Company:\nLiterally Media is a digital publishing house that owns and operates a collection of highly successful humor and entertainment websites. The portfolio of legendary digital brands includes eBaum’s World, Cheezburger, Know Your Meme, and Cracked, which dominate the entertainment market with over 50 million organic users a month.\u003c/p\u003e\n\u003cp\u003eBe part of the most exciting and fulfilling company in the local digital media space, where we reach millions of people across the world with fun, entertaining brands they keep coming back to. This is a full-time position based remotely, with the option to work out of our offices in Brooklyn, NY.\u003c/p\u003e\n\u003cp\u003eJob Description:\nLiterally Media is searching for an experienced, full time, Ruby on Rails web developer to join the KnowYourMeme team. Responsibilities include the full-stack ownership and development of the KnowYourMeme application, platform, and infrastructure. Ideal candidates include self-starters with a passion for internet and technology, with an emphasis on supporting the growth of the site, brand, and community.\u003c/p\u003e\n\u003cp\u003eThis mid-senior level position comes with a lot of responsibility. You will be architecting and implementing site features in their entirety which will then be served to tens of millions of users per month. You will report to our Head of Product \u0026amp; Technology and work closely with various teams throughout the organization.\u003c/p\u003e\n\u003cp\u003eAbout Development at Literally Media:\nAt Literally Media, we work together to craft software and features that make us proud. We care about our customers and strive to meet the needs of the Monetization, Business and Editorial teams.\u003c/p\u003e\n\u003cp\u003eAs a developer for KnowYourMeme, you’ll work with a small team of focused individuals who are serious about making a great product; and even more serious about having a great time interacting with our various teams spanning the globe. Every member of our team is vital and has the opportunity to influence the direction of the product, architecture, and the company at large.\nWe are an agile organization that embraces iterative development \u0026amp; continuous deployment with a key focus on data-driven decision making.\u003c/p\u003e\n\u003cp\u003eMust Haves (Basic Qualifications):\u003c/p\u003e\n\u003cp\u003e●  At least 5 years of proven experience working as a software developer\u003c/p\u003e\n\u003cp\u003e●  Applied knowledge and understanding of our Platform specifications (see below)\u003c/p\u003e\n\u003cp\u003e●  Experience developing on front \u0026amp; backend consumer facing websites\u003c/p\u003e\n\u003cp\u003e●  Experience with Ruby on Rails, Commonly used Gems, MVC, and interfacing with front end technologies such as HTML, HAML, CSS, and Javascript\u003c/p\u003e\n\u003cp\u003e●  Familiarity with commonly used front-end libraries, frameworks and tools\u003c/p\u003e\n\u003cp\u003e●  Experience with Agile development practices\u003c/p\u003e\n\u003cp\u003e●  Familiar with UX \u0026amp; UI best principles, with a keen eye for mobile and desktop design\u003c/p\u003e\n\u003cp\u003e●  Proficient in architecting and integrating with a wide variety of web service APIs\u003c/p\u003e\n\u003cp\u003e●  Proficient understanding of code versioning with git\u003c/p\u003e\n\u003cp\u003e●  Proficient operating in a Linux environment\u003c/p\u003e\n\u003cp\u003e●  A very high degree of intellectual curiosity, and a passion for software development\u003c/p\u003e\n\u003cp\u003eOptional (Nice to Have):\u003c/p\u003e\n\u003cp\u003e●  Work experience with an online digital publisher\u003c/p\u003e\n\u003cp\u003e●  Experience with DFP, Header Bidding, and Native Advertising\u003c/p\u003e\n\u003cp\u003e●  Experience with Google Analytics\u003c/p\u003e\n\u003cp\u003e●  An analytical mindset to facilitate the data-driven company needs\u003c/p\u003e\n\u003cp\u003e●  Interest in Internet \u0026amp; Meme culture\u003c/p\u003e\n\u003cp\u003e●  Experience integrating with Social Platforms (Facebook, Twitter, Pinterest)\u003c/p\u003e\n\u003cp\u003e●  BS/MS degree in Computer Science, Engineering or in a related field a plus\u003c/p\u003e\n\u003cp\u003eOur Platform:\n●  Language: Ruby\n●  Framework: Ruby on Rails\n●  Databases: MySQL, Redis\n●  Caching: Memcache\n●  Infrastructure: Self hosted, Ubuntu, Nginx/Unicorn web servers\n●  HAProxy Load Balancer\n●  Front End: Bootstrap, HAML\n●  Images: ImageMagick for processing, s3 for storage\n●  CDN\n●  Deployment: Capistrano Ruby gem (SSH \u0026amp; Git)\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail you resume to: \u003ca href=\"mailto:careers@literally.media\"\u003ecareers@literally.media\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWloIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4c4cfa24d3d58784b8f8fd7b1750edf4712924cc/Literally%20Logo%20.png"},{"id":"b5ece380-2e4a-4194-a6f4-2205a4ead3d1","type":"Full Time","url":"https://jobs.github.com/positions/b5ece380-2e4a-4194-a6f4-2205a4ead3d1","created_at":"Tue Apr 20 08:22:27 UTC 2021","company":"OnePlanet","company_url":"http://oneplanet.com","location":"UK/remote","title":"React / Material-UI Front End developer","description":"\u003cp\u003eOne Planet Digital Ltd ( OnePlanet.com) is a company building and promoting a radical new digital\nplatform that enables users intuitively to create, share and connect sustainability plans.\u003c/p\u003e\n\u003cp\u003eOnePlanet.com uniquely allows cross-departmental and cross-sector working – enabling\nconnections to be made all the way from citizens and students to city-wide plans. It uses graph\ndatabase technology, some of which has been developed by the OnePlanet.com team and will be\nunderpinned by machine learning and AI to help users make the best sustainability decisions\npossible.\u003c/p\u003e\n\u003cp\u003eTechnical environment\u003c/p\u003e\n\u003cp\u003eOnePlanet.com Web Application is an Isomorphic environment where Server and client data are\nshared and written in the same common language: RUBY.\nOn the server side we are using RubyOnRails stack and NEO4J as a graph database.\nOn the client side we are using REACT wrapped into a RUBY language layer (thanks to\nhyperstack.org).\u003c/p\u003e\n\u003cp\u003eAdditionally Material-UI and Vis.js for the presentation layer\u003c/p\u003e\n\u003cp\u003eWhat you will be doing\u003c/p\u003e\n\u003cp\u003e● Work with the team to create ways to improve OnePlanet.com products\n● Work super closely with backend specialists to find the best trade-offs in terms of\ntechnology and user experience\n● Coding UI webpage and Front end tools In REACT / CSS / RUBY\n● Ability to build responsive, cross-browser user interfaces from design prototype\n● Contributing generally as part of the team\nRequired qualifications\n● Experience with FrontEnd coding (REACT / Material UI / Javascript)\n● Strong ability to deliver clean and detailed UI elements and pages\n● Solid experience in Responsive and adaptive design and coding\n● Proficient understanding of code versioning tools (Git)\n● Interest in learning how to work in an Isomorphic environment (Server / Client all in ruby)\n(hyperstack.org)\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your interest in OnePlanet along with a resume to \u003ca href=\"mailto:HR@oneplanet.com\"\u003eHR@oneplanet.com\u003c/a\u003e .  We look forward to hearing from you.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEdoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--45a276312a4674b913d85e32dd26de51b5e9f237/OnePlanet%20new%20logo.png"},{"id":"2ee7639e-afe2-4cc7-bcf9-95a51ec900a4","type":"Full Time","url":"https://jobs.github.com/positions/2ee7639e-afe2-4cc7-bcf9-95a51ec900a4","created_at":"Mon Apr 19 07:40:54 UTC 2021","company":"OnePlanet","company_url":"http://oneplanet.com","location":"UK/remote","title":"Full stack developer - RubyonRails ","description":"\u003cp\u003eOne Planet Digital Ltd (OnePlanet.com) is a company building and promoting new digital platform\nthat enables users to create, share and connect sustainability plans.\nOnePlanet.com uniquely allows cross-departmental and cross-sector working – enabling connections to be made all the way from citizens and students to city-wide plans. It uses graph database technology, some of which has been developed by the OnePlanet.com team and will be underpinned by machine learning and AI to help users make the best sustainability decisions possible.\u003c/p\u003e\n\u003cp\u003eThe company is built on the premise that environmental and social challenges offer a massive\nopportunity to create a scalable and profitable business which can do good.\u003c/p\u003e\n\u003cp\u003eOnePlanet.com Web Application is an Isomorphic environment where Server and client data are\nshared and written in the same common language: RUBY.\u003c/p\u003e\n\u003cp\u003eOn the server side we are using RubyOnRails stack and NEO4J as a graph database. On the client side we are using REACT wrapped into a RUBY language layer (thanks to hyperstack.org). Additionally Material-UI and Vis.js for the presentation layer.\u003c/p\u003e\n\u003cp\u003eWhat you will be doing\u003c/p\u003e\n\u003cp\u003e● Work with the team to create ways to improve OnePlanet.com products\n● Work closely together with our CTO and take part in architectural decision making\n● You'll work on bug fixing and improving application performance.\n● As you gain context, you’ll provide technical guidance to teammates and insight into technical\ndecisions to product managers.\n● You will contribute to our engineering standards to continuously improve the consistency and\nquality of our codebases and processes.\n● Implementing users interface or admin interface for management and visualization of products\nand data.\nElaborating data model with a graph database\n● Using RubyOnRails Services for re-writing part of the application\n● Implementing Unit tests\n● Contributing generally as part of the team\nRequired qualifications\n● Deep understanding of computer science, object-oriented analysis, and software design\nprinciples\n● Experience with Ruby on Rails, along with other common libraries such as RSpec\n● Experience with FrontEnd coding (REACT / Material UI / Javascript)\n● Familiarity with concepts of MVC, Mocking, ORM, and RESTful\n● Able to create database schemas that represent and support business processes\n● Proficient understanding of code versioning tools (Git)\n● Proficient understanding of Server and Client stack\n● Knowledge of or interest in learning how to work in an Isomorphic environment (Server / Client all in ruby)\n(hyperstack.org)\n● Interest in learning and working with a Graph Database (Neo4j)\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail you resume and short covering letter to \u003ca href=\"mailto:hr@oneplanet.com\"\u003ehr@oneplanet.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmloIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a8ede6ee47e87331f70ade19cf9656108337f421/OnePlanet%20new%20logo.png"},{"id":"4ffc7bf8-eb3d-4491-9dda-050dbdd4843c","type":"Contract","url":"https://jobs.github.com/positions/4ffc7bf8-eb3d-4491-9dda-050dbdd4843c","created_at":"Thu Apr 15 23:39:05 UTC 2021","company":"SweetRush","company_url":"https://www.sweetrush.com/","location":"Remote","title":"Senior Ruby on Rails Full Stack Developer","description":"\u003cp\u003e\u003cstrong\u003eSweetRush has an exciting opportunity for a Senior Ruby on Rails Full Stack Developer to join our IT team and help us build functional software and web-based applications!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePlease Note: This position is for a three-month contract. Although, for the right candidate this opportunity might be extended or hired. Ideally, the candidate would work in the Pacific Time Zone. Otherwise, there should be at least 4 hours of overlap with the Pacific Time Zone, between the hours of 8am to 5pm.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the role:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA Senior Ruby on Rails Full Stack Developer would be expected to help create backend solutions, creating gems, writing efficient, secure, test-driven code, and helping to create the front end. This position will also require working with a large existing code base, debugging, improving, and securing the code base. All while using TDD methodologies to help write robust and rock-solid code.\u003c/p\u003e\n\u003cp\u003eUltimately, you will contribute in all phases of the software development life cycle, from design to deployment.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWrite effective and scalable test-driven code in Ruby and the Rails framework\u003c/li\u003e\n\u003cli\u003eBuild back-end components for web applications\u003c/li\u003e\n\u003cli\u003eTest applications for performance, responsiveness, and security\u003c/li\u003e\n\u003cli\u003eReview and debug junior developers’ code\u003c/li\u003e\n\u003cli\u003eBuild, install and share gems and plugins\u003c/li\u003e\n\u003cli\u003eCreate automated test scripts\u003c/li\u003e\n\u003cli\u003eWrite solid Test-Driven code.\u003c/li\u003e\n\u003cli\u003eImprove and maintain applications after deployment\u003c/li\u003e\n\u003cli\u003eCoordinate with team members who work on different layers of infrastructure and timezones\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequired Skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e6-10 years of experience coding\u003c/li\u003e\n\u003cli\u003eProven work experience as a Ruby on Rails developer\u003c/li\u003e\n\u003cli\u003eDemonstrable knowledge of front-end technologies such as JavaScript, HTML, CSS, and JQuery\u003c/li\u003e\n\u003cli\u003eVueJS knowledge a plus\u003c/li\u003e\n\u003cli\u003eExperience developing highly interactive applications\u003c/li\u003e\n\u003cli\u003eA firm grasp of object-oriented analysis and design\u003c/li\u003e\n\u003cli\u003ePassion for writing great, simple, clean, efficient test-driven code\u003c/li\u003e\n\u003cli\u003eGood knowledge of relational databases\u003c/li\u003e\n\u003cli\u003eExcellent ability to prioritize\u003c/li\u003e\n\u003cli\u003eHighly organized and detail-oriented\u003c/li\u003e\n\u003cli\u003eExcellent analytical and problem-solving skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePlease note: We're all about remote work and have collaborators based all around the world; however, SweetRush is a US-based company, and English is our primary language. If you'd like to be considered for this opportunity, please submit your resume in English.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePS: A bit about SweetRush—This year we will celebrate our 20th-anniversary developing performance improvement / training solutions. We have a significant list of high-profile clients such as Google, CVS, Hilton, Bridgestone, Mondelez, Cisco, — and we are very good at keeping our clients happy and working with us year after year. We are a powerhouse of blended learning solutions and extremely adept at crafting highly engaging, graphically rich, blended learning experiences, including gamification and mobile learning. We’ve developed a powerful authoring system that allows us to go well beyond what most vendors or off-the-shelf tools can offer and deliver, but we are also masters of the industry-standard tools and utilize them regularly. We are very focused on project management and keeping large and complex projects moving smoothly. We have a fantastic team and culture and a ‘near-zero’ turnover. We are that unique kind of company where everyone feels respected acknowledged and treated fairly. In 2009, we went virtual and our team is geographically distributed, but very tightly connected.\u003c/p\u003e\n\u003cp\u003eWe have managed, largely via referrals and marketing, to attract a great group of clients, and we anticipate quite a bit of continued growth into 2021.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eIf this describes your interests and experience, please submit a current resume and your salary requirements through the following link:\n\u003ca href=\"https://www.sweetrush.com/join-us/\"\u003ehttps://www.sweetrush.com/join-us/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe look forward to meeting you!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa21oIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8041613589ca7136fef188121475c9fe2a8bb63b/SWEETRUSH_LOGO_fullcolor.png"},{"id":"f4250b25-4c26-44b3-96d6-3298e0cac40d","type":"Full Time","url":"https://jobs.github.com/positions/f4250b25-4c26-44b3-96d6-3298e0cac40d","created_at":"Thu Apr 15 16:47:36 UTC 2021","company":"4Degrees","company_url":"http://4degrees.ai","location":"Chicago (open to Remote)","title":"Senior Software Engineer","description":"\u003ch2\u003eThe short version\u003c/h2\u003e\n\u003cp\u003eEarly-stage venture-backed startup looking for a software engineer to use Python, Javascript, and HTML/CSS to help build out our web platform. Good fit if you like moving fast, having impact, and working on a variety of different things.\u003c/p\u003e\n\u003ch2\u003eWho we are\u003c/h2\u003e\n\u003cp\u003eWe’re a fast-moving startup with a vision to empower all professionals by helping them build better relationships. Our vision is to fix the network gap: the inequality of opportunity driven by not having the right connections. To solve this problem, we’re combining the best practices of the world’s top relationship builders with artificial intelligence.\u003c/p\u003e\n\u003cp\u003eWe’re building a mission-driven team that strives to live out our values every day:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCustomer-centricity\u003c/li\u003e\n\u003cli\u003eDiversity of perspective\u003c/li\u003e\n\u003cli\u003eAuthenticity\u003c/li\u003e\n\u003cli\u003eGrowth (individual and collective)\u003c/li\u003e\n\u003cli\u003eImpact\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe’re an ambitious, driven team and we push ourselves to accomplish a lot quickly. In the past couple of years we've gone through one of the world's top accelerators, raised two rounds of venture financing, launched our product, rapidly grown our customer base, and architected a robust set of machine learning models as a core source of competitive advantage. In the process, we’ve been named one of Chicago’s top 50 startups to watch, one of Chicago Inno’s 50 on Fire, a part of the highly selective Google for Startups Black Founders Accelerator and Black Founders Fund. And we’re just getting started!\u003c/p\u003e\n\u003ch2\u003eThe opportunity\u003c/h2\u003e\n\u003cp\u003e4Degrees is at an inflection point - we’ve built a product that’s pioneering a new category of software (relationship intelligence), and are rapidly growing.  We're well funded, have hundreds of highly engaged customers, who consistently increase their contract size with us, and are planning with us on how we can take this company into the future.  We’ve done this with a scrappy, early-stage team.\u003c/p\u003e\n\u003cp\u003eThe opportunity ahead of us is vast - every business that relies on their relationship network to drive their business has a use case for 4Degrees.  To seize that opportunity, we're looking for great engineers to help us build on top of the foundation we've created, while also pioneering new ways to help our customers unlock the value their relationships can bring to their business.  You’ll build and use a versatile set of skills: switching between tasks like rolling out major new functionality, diagnosing and fixing bugs, and playing support for other front-end or back-end engineers.\u003c/p\u003e\n\u003cp\u003eBy joining us, you will play a highly impactful role in re-inventing the way professional relationships are managed and building a rapidly growing category. Along the way, you’ll have an opportunity to get unrivaled exposure to all facets of building a startup, and directly shape the outcomes of 4Degrees and its customers.  And if you want to build a company of your own after joining us, you'll get direct mentorship from the founding team and support in doing so!\u003c/p\u003e\n\u003ch2\u003eThe impact you’ll make by joining us\u003c/h2\u003e\n\u003ch3\u003eWithin 1 month you’ll:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eComplete our onboarding process - which will help you ramp up on our company, vision, product, key objectives, and how your role will contribute to all of those!\u003c/li\u003e\n\u003cli\u003eDive deep into our product development process and understand how we go from concept to design to implementation\u003c/li\u003e\n\u003cli\u003eLearn our technical stack and apply development patterns throughout your work\u003c/li\u003e\n\u003cli\u003eShip your first small feature to our customers\u003c/li\u003e\n\u003cli\u003eJoin our customer outreach program - including sitting in on your first set of live conversations with existing customers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWithin 3 months you’ll:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eAssume ownership of a quarterly roadmap project, which will enable you to drive the development of a key piece of functionality for our customers\u003c/li\u003e\n\u003cli\u003eDrive timely resolution of customer issues, in coordination with the customer success and implementation teams.\u003c/li\u003e\n\u003cli\u003eHave made a visible impact on the product for all 4Degrees users\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWithin 6 months you’ll:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eReliably ship full features to our customers and for internal team use\u003c/li\u003e\n\u003cli\u003eUnderstand the product at scale and be able to provide input to improve our technical systems and tools\u003c/li\u003e\n\u003cli\u003eBe comfortable navigating most of our stack and infrastructure\u003c/li\u003e\n\u003cli\u003eParticipate in interviewing and hiring, as a way to influence team growth and how our values inform our culture\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWithin 1-2 years, you’ll:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eBe responsible for the planning, scoping, design, and implementation of new features\u003c/li\u003e\n\u003cli\u003eChampion future engineering initiatives\u003c/li\u003e\n\u003cli\u003eHelp build and shape the future of engineering at 4Degrees\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAbout you\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eExcited about the 4Degrees mission and believes in our core values\u003c/li\u003e\n\u003cli\u003eThrives in a fast-paced environment, and is comfortable with experimentation and risk-taking\u003c/li\u003e\n\u003cli\u003eDriven by the opportunity to create impact, and takes full ownership of achieving personal and team objectives\u003c/li\u003e\n\u003cli\u003eMotivated to explore the potential for technology to augment people’s ability to form and strengthen professional relationships\u003c/li\u003e\n\u003cli\u003eChallenges existing industry best practices and takes inspiration from disparate sources to build a groundbreaking product\u003c/li\u003e\n\u003cli\u003eCollaborative mindset - recognizing that most great outcomes are accomplished by teams, not individuals\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eSkills you’ll need\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eProficiency with back-end programming (Python preferred, but we can train you if you're good with Ruby, Node, PHP, etc.)\u003c/li\u003e\n\u003cli\u003eProficiency with front-end programming in vanilla languages (Javascript, HTML, CSS)\u003c/li\u003e\n\u003cli\u003eComfort with plain SQL and an ORM\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWe’d be really excited if you are\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eExperienced with mobile development, particularly using React Native\u003c/li\u003e\n\u003cli\u003eExperienced with the Flask web framework\u003c/li\u003e\n\u003cli\u003eExperienced with machine learning and/or statistical analysis\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBenefits\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive cash+equity compensation based on level of capability\u003c/li\u003e\n\u003cli\u003eUnlimited PTO (min. 2 weeks, avg. 3-4)\u003c/li\u003e\n\u003cli\u003eUnlimited paid sick leave (mandatory for infectious diseases)\u003c/li\u003e\n\u003cli\u003eEmployer group health insurance, subsidized 75% by company\u003c/li\u003e\n\u003cli\u003eAnnual professional development stipend\u003c/li\u003e\n\u003cli\u003eCommuter benefits\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eSend over a quick note with your resume and thoughts on why this role is exciting to you to \u003ca href=\"mailto:talent@4degrees.ai\"\u003etalent@4degrees.ai\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eOur values are critical to us; in your email, please also talk a bit about how these values resonate with you.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanVoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8f5bc28f1b7b3497630bd77c9f90d4268440bf6a/4d-logo-purple-flat-square.png"},{"id":"52782821-a69e-4dac-b18a-83cf903cefcf","type":"Full Time","url":"https://jobs.github.com/positions/52782821-a69e-4dac-b18a-83cf903cefcf","created_at":"Thu Apr 15 15:15:18 UTC 2021","company":"Bison Technologies","company_url":"https://vonq.io/3sqeOch","location":"Oklahoma City","title":"Software Developer (Remote Opportunities Available)","description":"\u003cp\u003eWe are looking for a Software Developer to build and implement functional programs. You will work with other Developers and Product Managers throughout the software development life cycle. The ideal candidate possesses strong analytical and technical skills and has experience with multiple coding languages. Must be comfortable working in an agile environment.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKey Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop, test, and implement new software programs\u003c/li\u003e\n\u003cli\u003eProduce clean, efficient code based on specifications\u003c/li\u003e\n\u003cli\u003eAnalyze user requirements\u003c/li\u003e\n\u003cli\u003eWrite and test code to ensure compatibility and stability, refine, and rewrite as necessary\u003c/li\u003e\n\u003cli\u003eMonitor quality and performance of applications through testing and maintenance\u003c/li\u003e\n\u003cli\u003eCreate clear technical specifications\u003c/li\u003e\n\u003cli\u003eExpand existing software to meet the changing needs of our customers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s Degree or equivalent education and/or work experience\u003c/li\u003e\n\u003cli\u003e5+ years’ software development or programming experience\u003c/li\u003e\n\u003cli\u003eHave thorough understanding of computer architecture, operating systems, and data structures\u003c/li\u003e\n\u003cli\u003eExperience in JavaScript, TypeScript, Ruby, and/or Python\u003c/li\u003e\n\u003cli\u003eExperience with test-driven development and automated testing frameworks\u003c/li\u003e\n\u003cli\u003eExperience with Scrum/Agile development methodologies\u003c/li\u003e\n\u003cli\u003eHave logical, analytical, and creative approach to problem-solving\u003c/li\u003e\n\u003cli\u003eCapable of delivering on multiple competing priorities with little supervision\u003c/li\u003e\n\u003cli\u003eComfortable in a fast-moving, cross-functional team in a start-up environment\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3afSo7t\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWloIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e3ca15101f4b70afe51e91401868f0b99f8f62b1/logo-dark.png"},{"id":"5d1b909c-7fdd-4a09-a422-29a2f9e09264","type":"Full Time","url":"https://jobs.github.com/positions/5d1b909c-7fdd-4a09-a422-29a2f9e09264","created_at":"Wed Apr 14 19:43:29 UTC 2021","company":"Kalkomey","company_url":"http://www.kalkomey.com","location":"US - Remote","title":"Senior Software Engineer","description":"\u003cp\u003eAbout Kalkomey\u003c/p\u003e\n\u003cp\u003eKalkomey is a leading provider of online recreational safety education, certifications, and cloud-based agency management solutions. The company serves both outdoor enthusiasts and state and local government agencies in all 50 U.S. states, as well as Australia, Canada, Guam, Mexico, New Zealand, Puerto Rico, and the United Kingdom. Through its learning management system, Kalkomey delivers regulatory-approved safety education courses and certifications for a broad spectrum of outdoor recreational activities, including boating, hunting, snowmobiling, off-roading and scuba diving, among others. Today, the company offers more than 360 courses worldwide and certifies nearly one million outdoor enthusiasts each year. Additionally, Kalkomey’s agency management solutions enable state agencies to drive greater operational efficiencies of key workflows from licensing and registration, to certification and event management, and compliance and reporting. Through the integration of its online safety education and agency management solutions, Kalkomey is able to deliver a single platform for recreational safety management that makes outdoor recreation more accessible, drives recreational activity, participation, and increases civic engagement.\u003c/p\u003e\n\u003cp\u003eFounded in 1995, Kalkomey has over 100 employees and is headquartered in Richardson, TX. The company maintains additional offices in Canada, Australia, South Africa, and Sweden.\u003c/p\u003e\n\u003cp\u003eKalkomey is seeking a Senior Software Developer to join our Technology \u0026amp; Development team.\u003c/p\u003e\n\u003cp\u003eEssential Duties and Responsibilities\u003c/p\u003e\n\u003cp\u003eThis position is crucial to helping drive and push technology using the Ruby on Rails stack; as well as to transition, migrate, and take tactical and strategic approaches with all of the company’s software.\u003c/p\u003e\n\u003cp\u003eParticipate in the analysis of customer and vendor requirements and provide technical direction on the creation of detailed program design specifications for high complexity user interfaces, application enhancements, new functionality and backend processes in collaboration with customers, Business System Analysts and other project team members.\u003c/p\u003e\n\u003cp\u003eDevelops and modifies complex, deadline-intensive and/or mission-critical applications using advanced programming tools\u003c/p\u003e\n\u003cp\u003eDocuments all code using standard forms and procedures and review others work as appropriate\nAssists others in the use of programming tools and recommend tools to best meet application needs\u003c/p\u003e\n\u003cp\u003eRecommends process, methodology and tool changes in conjunction with Architects and QA to best meet the needs of the department and client\u003c/p\u003e\n\u003cp\u003eWorks with QA to participate in unit, system and user acceptance testing based on an understanding of the development lifecycle\u003c/p\u003e\n\u003cp\u003eParticipates in architectural recommendations/decisions and work with other infrastructure groups as applicable to determine and implement complex system hardware requirements that may involve multiple platforms, databases, peripherals or other technology\u003c/p\u003e\n\u003cp\u003eProvides the highest level of technical production support for applications, assists others with complex problem resolution and responds with solutions to both functional and technical issues in a timely manner\u003c/p\u003e\n\u003cp\u003eWorks with Business System Analysts, Project Managers or other management to recommend process or system enhancements\u003c/p\u003e\n\u003cp\u003eWorks with DBAs, Architects and other team members to ensure logical and physical data models and relationship diagrams are completed and executed according to methodology and user requirements\u003c/p\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cp\u003eSuccessful track record developing quality software products\nExperience working with the following technologies:\nRuby\nRails\nMySQL\nAngular2 and/or React \nGit\nHTML/CSS\nBootstrap\nJavaScript/jQuery\nResponsive Web Design\nSEO\nLinux fundamentals\nAnsible (nice to have)\nAbility to mentor junior developers\nAbility to work in a collaborative team environment and independently\nExperience with Agile/Scrum development methodologies  \nUnderstanding of the SDLC\nExcellent communication skills\nExcellent attention to detail\nEducation and Experience\u003c/p\u003e\n\u003cp\u003eBachelor’s degree in Computer Information Systems or relevant field is preferred with six to ten years of experience in software development using Ruby on Rails.\u003c/p\u003e\n\u003cp\u003ePhysical Requirements\u003c/p\u003e\n\u003cp\u003eThis is generally a sedentary role, requiring the use of typical office equipment such as a computer and phone. Must have the ability to lift up to 10 lbs. Must be able to perform the essential job functions consistent with this job description.\u003c/p\u003e\n\u003cp\u003eBenefits\u003c/p\u003e\n\u003cp\u003eWe offer a competitive compensation package which includes an employer matched 401(k) plan, medical/dental/vision with a generous employer contribution, company paid life insurance, voluntary STD/LTD coverage, a casual and dog-friendly office, 3 weeks paid vacation, maternity and paternity benefits, and a flexible work schedule!\u003c/p\u003e\n\u003cp\u003eKalkomey Enterprises, LLC is an Equal Opportunity Employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply via our website at \u003ca href=\"http://www.kalkomey.com\"\u003ewww.kalkomey.com\u003c/a\u003e or send your resume directly to our HR department at \u003ca href=\"mailto:HR@kalkomey.com\"\u003eHR@kalkomey.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3VoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fb37a07ec0ed828a347850b8c8d5c0a2278165a6/KalkomeyLogo_COLOR.png"},{"id":"4cb87de1-8c92-4c41-bf23-f90daa83e739","type":"Full Time","url":"https://jobs.github.com/positions/4cb87de1-8c92-4c41-bf23-f90daa83e739","created_at":"Wed Apr 14 13:45:51 UTC 2021","company":"Smile.io","company_url":"https://smile.io/careers","location":"Anywhere","title":"Senior Software Engineer","description":"\u003cp\u003eSmile.io is the world’s largest loyalty platform, providing easy-to-use reward programs that help scaling e-commerce brands transform one-time sales into repeat, loyal customers. Over 60,000 brands use Smile to turn transactional purchases into passionate repeat shoppers.\u003c/p\u003e\n\u003cp\u003eWe’re celebrating explosive growth and need your help empowering every entrepreneur to grow their brand and build lasting relationships with their customers. We are a remote-first company, and we believe you should be able to work from anywhere. We have team members working from home offices across the globe, and our team has never been more connected. Tell us where you'd like to work when you apply!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the Team:\u003c/strong\u003e\nThe engineering team at Smile.io believes in being proud of your code, owning what you ship, and embracing new tools to increase developer happiness. We believe small, empowered teams can ship products with the highest impact. Right now we’re working on expanding our product to support the massive growth of e-commerce.\u003c/p\u003e\n\u003cp\u003eWe currently power over 60,000 rewards programs, reaching more than 500 million customers, and serving 1M API requests/hour. Our primary deployment languages are Ruby on Rails, React \u0026amp; Ember.js, but as a team, we enjoy learning new languages and technologies - so this list could change! We use Github, Slack, and CircleCI to communicate efficiently and ship code every day.\u003c/p\u003e\n\u003cp\u003eWe value diversity, inclusion, and belonging. It helps us build a better product, it helps us create opportunity for growth and change. It helps us enjoy the work we do and create a supportive creative environment to do our best work. It helps us to be human.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the Role:\u003c/strong\u003e\nAs a Software Engineer, you'll be working on a distributed team with diverse skills across the tech stack. We build features, enhancements, experiments, and deliver sustainable, quality software in an agile environment.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you'll help us achieve:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWrite, test, instrument, document, and maintain software for Smile.io\u003c/li\u003e\n\u003cli\u003eReview code and provide thoughtful, constructive feedback for your team\u003c/li\u003e\n\u003cli\u003eCollaborate closely with Product, Design, and partner Engineering teams to build new features.\u003c/li\u003e\n\u003cli\u003eAnalyze how your features are performing in production to learn and make the product better\u003c/li\u003e\n\u003cli\u003eSupport a highly available service used by millions of users on a daily basis\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho you are:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave high empathy in everything you do\u003c/li\u003e\n\u003cli\u003e5+ years technical experience in software engineering or similar\u003c/li\u003e\n\u003cli\u003eHave built web experiences and systems at scale\u003c/li\u003e\n\u003cli\u003eEnjoy and thrive in a remote-first, distributed work culture\u003c/li\u003e\n\u003cli\u003eAre highly self-directed and take initiative to go above and beyond expectations\u003c/li\u003e\n\u003cli\u003eValue clear written and verbal communication\u003c/li\u003e\n\u003cli\u003eBelieve  mentoring, and sharing information is better than hoarding it\u003c/li\u003e\n\u003cli\u003eAble to pick up new concepts quickly and put them into practice\u003c/li\u003e\n\u003cli\u003eUse data to validate your hypotheses and inform your decision making\u003c/li\u003e\n\u003cli\u003eYou enjoy automating and scaling\u003c/li\u003e\n\u003cli\u003eYou believe in simplicity over complexity\u003c/li\u003e\n\u003cli\u003eYou value agility and the ability to shift focus quickly\u003c/li\u003e\n\u003cli\u003eYou value products over projects\u003c/li\u003e\n\u003cli\u003eYou’re more focused on outcomes over output\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus if you have:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEcommerce Industry Experience\u003c/li\u003e\n\u003cli\u003eAPI Development Experience\u003c/li\u003e\n\u003cli\u003eExperience with complex data structures and data architecture\u003c/li\u003e\n\u003cli\u003eExperience with automated integration testing and test automation\u003c/li\u003e\n\u003cli\u003eSecurity by Design, and Privacy by Design principles\u003c/li\u003e\n\u003cli\u003eExperience with Amazon Web Services, Postgres, Kafka, Elasticsearch\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho are we?\u003c/strong\u003e\nEveryone at Smile is driven by these core values:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe Humble - think of the team before thinking of yourself. We have no room for massive egos.\u003c/li\u003e\n\u003cli\u003eBe Hungry - set hard goals, ask lots of questions, and learn every day.\u003c/li\u003e\n\u003cli\u003eBe Human - show empathy towards others, consider the impact of your decisions on other teams.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe know that Smile.io as a business is in constant evolution - the same is true of our people. We’re here to support each other in our growth, so we talk openly about our career \u0026amp; personal goals. With such a diverse team of people, we know we can offer you the mentorship, tools, and encouragement you need to grow.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSend us an application to: \u003ca href=\"https://jobs.lever.co/Smile.io/9b8f234c-1686-4fb0-9708-ee1f1775fa86\"\u003ehttps://jobs.lever.co/Smile.io/9b8f234c-1686-4fb0-9708-ee1f1775fa86\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdktnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d55f126113a9088617b7bf281a7b3d5c012af12d/001%20(1).png"},{"id":"80f3b7f0-97ca-47a7-a751-89f9d766b0c6","type":"Full Time","url":"https://jobs.github.com/positions/80f3b7f0-97ca-47a7-a751-89f9d766b0c6","created_at":"Wed Apr 14 12:20:37 UTC 2021","company":"Clark Germany GmbH","company_url":"https://www.clark.de","location":"Frankfurt","title":"Senior Software Engineer (m/f/x)","description":"\u003cp\u003e\u003cstrong\u003eWho is Clark (\u003ca href=\"http://www.clark.de\"\u003ewww.clark.de\u003c/a\u003e)?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSince our founding in 2015, we follow our Vision to create a world where people love insurance by using the Clark insurance Manager App. This is not only recognized by 150.000 customer; Bloomberg named us as one of the 50 most promising startups in the world 2017 as well. Due to our smart technology and our expert know how, we are combining the old and the new world, which makes our products for the B2B as well as B2C-market highly attractive. With a total funding of 45mio $, led by Portag3 Ventures and White Star Capital, we are ready to conquer the world!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAs our Senior Software Engineer, you..\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eplay a central role in the design and development of our backend system and architecture\u003c/li\u003e\n\u003cli\u003eactively contribute to product management and influence our features right from the start\u003c/li\u003e\n\u003cli\u003elift the intelligence of our robo advisor and the efficiency of our insurance operations team\u003c/li\u003e\n\u003cli\u003eclosely interact with colleagues who use your software to service our customers\u003c/li\u003e\n\u003cli\u003econceptualise and deliver features on a platform that will soon serve \u0026gt; 500000 customers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Background, you...\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave gained a Technical University or Bachelor's degree\u003c/li\u003e\n\u003cli\u003ehave minimum 4 years experience in software engineering and web development, incl. 2 years Ruby on Rails, as well as other languages\u003c/li\u003e\n\u003cli\u003ea deep understanding of modern software architecture and software design principles, e.g. SOLID, Event Processing, and Domain Driving Design, git, scrum and agile approaches\u003c/li\u003e\n\u003cli\u003etest-driven development and quality assurance through automated testing are selfevident\u003c/li\u003e\n\u003cli\u003egood knowledge of cloud infrastructure and continuous deployment\u003c/li\u003e\n\u003cli\u003eexperience with Javascript Frontend Frameworks especially with Ember are a plus\u003c/li\u003e\n\u003cli\u003eexcellent skills in handling SQL and relational database\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThis is Clark – this is what we love to offer you:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ebesides the usual startup perks like free drinks, free coffee, flat hierarchies, an experienced management and multicultural environment with international colleagues, we are offering you a lot of space for your work, your ideas and your initiatives.\u003c/li\u003e\n\u003cli\u003ewe subsidize your job ticket and the company pension scheme.\u003c/li\u003e\n\u003cli\u003ewant e.g. to move forward to make your Master or MBA, we offer you to support your education while working at Clark\u003c/li\u003e\n\u003cli\u003eif you need to work absolutely focused, you use our silent room – no disturbance, no noise.\u003c/li\u003e\n\u003cli\u003eif you need to relocate, you have our support.\u003c/li\u003e\n\u003cli\u003eyou need to brush up your German? We are offering beginner and advanced German courses!\u003c/li\u003e\n\u003cli\u003eyou want to share your knowledge and to inspire? Be a Speaker and create your own Brownbag speech to inspire your colleagues.\u003c/li\u003e\n\u003cli\u003eand last but not least: Sure, we know how to celebrate success! We offer you quarterly company events, monthly team lunch \u0026amp; breakfast as well as our weekly Friday get together.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis sounds like an exciting next step for you? We are more than ready for your application and cannot wait to receive it.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://clark.join.com/jobs/2089461-senior-software-engineer-m-f-x?pid=357a3b4531918760973f\u0026amp;oid=f16780b4-5ed8-458e-ad72-419c1a665787\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bsoftware%2Bengineer%2Bm%2Bf%2Bx\"\u003ehttps://clark.join.com/jobs/2089461-senior-software-engineer-m-f-x?pid=357a3b4531918760973f\u0026amp;oid=f16780b4-5ed8-458e-ad72-419c1a665787\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bsoftware%2Bengineer%2Bm%2Bf%2Bx\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUdnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf259abb757f7c297af856b622e44b3683110263/clark-germany-gmb-h-logo-xl.png"},{"id":"903242c6-d253-448e-84b1-69adc2dab9c0","type":"Full Time","url":"https://jobs.github.com/positions/903242c6-d253-448e-84b1-69adc2dab9c0","created_at":"Tue Apr 13 08:27:33 UTC 2021","company":"Microsoft","company_url":"https://vonq.io/3uCRIAO","location":"Dublin","title":"Digital Cloud Solution Architect - German","description":"\u003cp\u003eMicrosoft is empowering every person and every organization on the planet to do more and achieve more. We have set ourselves three bold ambitions: create more personal computing, reinvent productivity and business processes and build the intelligent cloud. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence and encouraging teams and leaders to bring their best each day.\u003c/p\u003e\n\u003cp\u003eAs part of our transformation, one of our key areas of focus is the modernization of our sales motions. The Small, Medium \u0026amp; Corporate organization is an organization with a charter to accelerate Microsoft’s growth in its cloud-first, mobile-first businesses along with the traditional businesses. This organization is at the forefront of establishing a new sales model leveraging modern technology and big data and analytics to drive impactful demand response and targeted sales coverage.\u003c/p\u003e\n\u003cp\u003eThe Cloud Solutions team consists of highly capable individuals that drive Microsoft wins on the latest cloud and modern development technologies. As a Cloud Solutions Architect, your primary responsibilities will be to engage with customers and Account Executives to understand the business’s needs, and then prove and design customer business solutions that leverage the Microsoft Cloud for Business with a focus on Microsoft Azure. You will own technical and solution envisioning with customers via Skype engagements including demos, custom demos, solution designs, implementation plans and proof of concepts. As a CSA, you will enjoy one of the most impactful positions within Inside Sales. In addition to senior level interaction with our customers, the CSA will be a sought-after subject matter expert by Microsoft sales teams for their technical leadership. CSAs will work with Microsoft counterparts to help educate them on our cloud offerings, positioning and joint selling strategies. You will also provide expertise on the business and technical value of Microsoft’s public cloud offerings versus the competition.\u003c/p\u003e\n\u003ch2\u003eResponsibilities\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the key technical contact for our Inside Sales team with potential customers\u003c/li\u003e\n\u003cli\u003eDemonstrate aspects of the technical and business solution to customers over Skype for Business.\u003c/li\u003e\n\u003cli\u003eExecute quick technical feasibility assessments and proposal developments for the customers identified solutions\u003c/li\u003e\n\u003cli\u003eScope the technical and security design for customer solutions, select optimal migration paths for the customer, build consumption plans, as well as execute limited POCs, where necessary\u003c/li\u003e\n\u003cli\u003eAudit and confirm implementation requirements and pricing calculations as required, so that the customer receives an accurate projection of anticipated costs in new services sought\u003c/li\u003e\n\u003cli\u003ePrepare technical insights and key scenarios required to drive the right technical and business solution outcomes\u003c/li\u003e\n\u003cli\u003eContribute to customer-facing publications such as whitepapers\u003c/li\u003e\n\u003cli\u003eConduct group and one-on-one trainings across the Center on subjects of expertise\u003c/li\u003e\n\u003cli\u003eMeet and exceed team-level monthly, quarterly and annual targets for net-new revenue and sales pipeline, as well as operational metrics\u003c/li\u003e\n\u003cli\u003eConstantly research and educate self with the newest developments in cloud capabilities and pricing for both Microsoft and competitor\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e4-year degree preferred / Degree or equivalent work experience required\u003c/li\u003e\n\u003cli\u003e2-6+ years of technology related sales or business development experience; Experience working within a technical sales environment preferred.\u003c/li\u003e\n\u003cli\u003eBroad knowledge of and ability to explain key end-user scenarios and technical architecture in the public cloud infrastructure and management space required\u003c/li\u003e\n\u003cli\u003eDemonstrated knowledge of identity, authentication, security, privacy, and compliance and how they factor into cloud and hybrid solutions preferred\u003c/li\u003e\n\u003cli\u003eUnderstand cloud deployment and adoption planning\u003c/li\u003e\n\u003cli\u003eExperience with cloud and hybrid infrastructures, architecture designs, migrations and management of technology.\u003c/li\u003e\n\u003cli\u003eDeep technical experience in one or more of the following areas :\u003c/li\u003e\n\u003cli\u003eSoftware design or development ;Application Design; Systems Operations / Management; Database architecture; Virtualization; IP Networking; Storage; IT Security; Linux\u003c/li\u003e\n\u003cli\u003eWorking knowledge with AGILE development, SCRUM and Application Lifecycle Management (ALM) with one or more of the following programming languages: .NET, C++, Java, JSON, PHP, Perl, Python, Ruby on Rails, Pig/Hive\u003c/li\u003e\n\u003cli\u003eAn understanding and passion for cloud computing technologies, business drivers, and emerging computing trends\u003c/li\u003e\n\u003cli\u003eMajor or minor in computer science, mathematics or engineering. Experience in one of these relevant fields is a bonus, computer science, mathematics or engineering.\u003c/li\u003e\n\u003cli\u003eProven track record of outstanding performance and achieving goals\u003c/li\u003e\n\u003cli\u003eTakes initiative to independently grow technical knowledge\u003c/li\u003e\n\u003cli\u003eExceptional interpersonal as well as verbal and written communication skills to succeed in a customer facing role\u003c/li\u003e\n\u003cli\u003eAbility to explain complex technical solutions to technical and non-technical audiences and to connect technological solutions with measurable business value\u003c/li\u003e\n\u003cli\u003eSuccess-driven, works well in a diverse team and enjoy a dynamic and changing environment\u003c/li\u003e\n\u003cli\u003ePassion for cloud technologies and changing the world\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eFluent German at a professional level is essential\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.\u003c/p\u003e\n\u003cp\u003eBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\u003c/p\u003e\n\u003ch2\u003eInterested?\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3uCRIAO\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3uCRIAO\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcTJnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4543560d101dd5dbcab74a1974ed1caa20881925/companyLogo-Logo%20(6).jpg"},{"id":"0e9fc2a4-dbe0-4930-845d-c8df56730837","type":"Full Time","url":"https://jobs.github.com/positions/0e9fc2a4-dbe0-4930-845d-c8df56730837","created_at":"Tue Apr 13 00:03:39 UTC 2021","company":"OneLogin","company_url":"http://www.onelogin.com","location":"Remote","title":"Engineering Lead, Test/Release Automation","description":"\u003cp\u003eABOUT THE ROLE:\u003c/p\u003e\n\u003cp\u003eOneLogin needs an experienced software engineer and technical team lead to assume ownership of all things Automation. Join our close knit Quality Engineering team that is responsible for the quality of our product offerings from the beginning of the SDLC all the way through the release to production.\u003c/p\u003e\n\u003cp\u003eProvide leadership for a team of automation engineers: providing solid feedback and advice to the team manager, managing team projects, and leading team meetings.\u003c/p\u003e\n\u003cp\u003eAssume principle ownership of our proprietary E2E test framework (Node.js, puppeteer, Ava):  enhance and maintain this framework, document its use, and provide training and tooling necessary to enable the feature teams to write their own effective and maintainable E2E tests.\u003c/p\u003e\n\u003cp\u003eConsult and collaborate with the Platform team to ensure that the CI/CD pipeline meets the needs of the company throughout the development, testing, and release cycles.\u003c/p\u003e\n\u003cp\u003eProject planning, implementation, and delegation to provide tooling to integrate the E2E tests into a continuous test pipeline.\u003c/p\u003e\n\u003cp\u003eBuild a system that provides telemetry, quality metrics, reports and alerting for automated tests.\u003c/p\u003e\n\u003cp\u003eParticipate in Release Management (with oversight) in the short term, until the current manual processes are effectively automated/streamlined.\u003c/p\u003e\n\u003cp\u003eDevelop, maintain, extend a software solution linking TestRail test plans with JIRA tickets and the E2E test framework for well directed automatic test run generation and reporting.\u003c/p\u003e\n\u003cp\u003eWhile this position is principally concerned with E2E tests, must be able to clearly communicate with and advise feature teams on effective unit and integration test coverage. \u003c/p\u003e\n\u003cp\u003eWill own measuring (not implementing) unit/integration test coverage, helping to ensure that we have comprehensive test coverage at the proper places in the test pyramid.\u003c/p\u003e\n\u003cp\u003eABOUT YOU:\u003c/p\u003e\n\u003cp\u003eThe right person for this position needs to be a strong contributor to the design and implementation of complex, multi-team software projects as well as providing leadership for the existing Automation engineers. Must be able and willing to participate in the manual deployment processes to understand and affect major releases and then implement  their replacement with automation.  Will participate in second tier on-call rotation for the systems the Automation team is responsible for.\u003c/p\u003e\n\u003cp\u003eIn order to truly be effective in OneLogin culture, the right candidate will need to cooperate with other teams to get the right things done, providing advice and guidance.  The successful candidate must stand on their principles but be flexible in approach, comfortable with finding best-fit solutions, tracking the technical debt any compromises introduce, and be vigilant in following up over time to eliminate that debt.\u003c/p\u003e\n\u003cp\u003e3+ years of Quality Engineering experience preferably in an enterprise SaaS company\u003c/p\u003e\n\u003cp\u003e3+ years NodeJS experience.  Familiarity with promises and functional programming will be a plus.  Experience with other programming languages, particularly Ruby a definite advantage.\u003c/p\u003e\n\u003cp\u003e3+ years of UI and API test automation, using Selenium, Puppeteer or similar.\u003c/p\u003e\n\u003cp\u003e3+ years experience building, using, maintaining CI/CD pipelines, gitHub Actions or similar a plus.\u003c/p\u003e\n\u003cp\u003e3+ years of small team tech lead experience.\u003c/p\u003e\n\u003cp\u003e2+ years Experience testing microservices, being mindful of dependencies between services and monolithic components.\u003c/p\u003e\n\u003cp\u003e1+ years of experience providing automatic quality metrics, using observability and monitoring tools (our stack includes Sumo, DataDog, NewRelic and Elasticsearch)\u003c/p\u003e\n\u003cp\u003eProfessional experience with Kubernetes, EKS, GKE, AKS, etc a plus.\u003c/p\u003e\n\u003cp\u003eDemonstrated ability to effectively partner with development teams on quality initiatives.\u003c/p\u003e\n\u003cp\u003eStrong communication and decision making skills with the ability to balance conflicting interests\u003c/p\u003e\n\u003cp\u003eBachelor’s degree in Computer Science, Engineering or related field\u003c/p\u003e\n\u003cp\u003eABOUT ONELOGIN:\u003c/p\u003e\n\u003cp\u003eOneLogin is the leader in Unified Access Management, Enabling Organizations to Access the World™. Businesses of all sizes use OneLogin to secure company data, while increasing IT administrator and end users efficiencies. Implementation of our identity management solutions can be achieved in hours not days, delivering a fully featured administrative and self-service portal. Our ability to handle on-premises and cloud/SaaS applications makes us the identity as a service vendor of choice for the hybrid enterprise. Two-factor authentication, mobile identity management for one-click access on smartphones and tablets, and real-time directory synchronization add an extra layer of protection.\u003c/p\u003e\n\u003cp\u003eOur core values:\u003c/p\u003e\n\u003cp\u003eSecurity first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind\nCustomer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value\nCollaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team\nAccountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels\nCreative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/97d274da1us\"\u003ehttps://grnh.se/97d274da1us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcCtnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ebd5ab8ae0cb54316363e2b26023287289036078/onelogin%20work%20mark.png"},{"id":"5633f376-475f-4016-ab7c-51bd1d327f88","type":"Full Time","url":"https://jobs.github.com/positions/5633f376-475f-4016-ab7c-51bd1d327f88","created_at":"Mon Apr 12 23:22:39 UTC 2021","company":"OneLogin","company_url":"http://www.onelogin.com","location":"Remote, US","title":"Senior BackEnd Software Engineer","description":"\u003cp\u003eABOUT THE ROLE\u003c/p\u003e\n\u003cp\u003eHELP US BUILD THE NEXT GENERATION OF CLOUD-BASED IDENTITY AND ACCESS MANAGEMENT (IAM) SOLUTIONS\nMAKE A BIG IMPACT ON PRODUCT IN A FLEXIBLE WORK ENVIRONMENT WITH A STRONG FOCUS ON PROFESSIONAL DEVELOPMENT\u003c/p\u003e\n\u003cp\u003eOneLogin provides industry-leading, enterprise IAM solutions for every user, device, and application. We manage and secure millions of identities for thousands of enterprise customers.  We just closed a $100M series-D, and we are growing. OneLogin provides industry-leading, enterprise IAM solutions for every user, device, and application. We manage and secure millions of identities for thousands of enterprise customers. As part of building out new cloud services, we’re looking for talented SOFTWARE ENGINEERS. \u003c/p\u003e\n\u003cp\u003eWHAT YOU’LL BE DOING:\u003c/p\u003e\n\u003cp\u003eWork on technically challenging product that is solving real problems for our customers\u003c/p\u003e\n\u003cp\u003eEnjoying friendly working environment where you can grow (a lot!)\u003c/p\u003e\n\u003cp\u003eCommunicating with other OneLogin engineers across the world\u003c/p\u003e\n\u003cp\u003eBuilding and designing secure, scalable, and reliable micro-services in cloud SaaS environment\u003c/p\u003e\n\u003cp\u003eRedesigning or splitting the legacy monolith in something much nicer\u003c/p\u003e\n\u003cp\u003eThinking out-of-the-box to come up with a solution to problems that do not seem to have one\u003c/p\u003e\n\u003cp\u003eContinuously trying new technologies and applying them if they make sense and solve customer problems\u003c/p\u003e\n\u003cp\u003eRuby, Rails, NodeJS, Javascript, React, Redis, Postgres, HAProxy, Networking, API’s, Authentication, MFA, RabbitMQ, Docker, Swarm, Consul, CI/CD … and a lot more and always changing\u003c/p\u003e\n\u003cp\u003eWHAT YOU BRING TO THE TABLE:\u003c/p\u003e\n\u003cp\u003eSecurity-first mindset\u003c/p\u003e\n\u003cp\u003eGetting things done attitude with focus on quality\u003c/p\u003e\n\u003cp\u003eBringing different perspectives and opinions\u003c/p\u003e\n\u003cp\u003e4+ years of experience working in SaaS or Cloud environment \u003c/p\u003e\n\u003cp\u003eStrong engineering ability in multiple languages - Ruby/Rails, Javascript/NodeJS are plus\u003c/p\u003e\n\u003cp\u003eKnowledge and interest in IAM/authentication is great\u003c/p\u003e\n\u003cp\u003eExperience working on the backend, with a background in building and deploying scalable micro-services\u003c/p\u003e\n\u003cp\u003eUnderstanding of best practices in the design of RESTful APIs\u003c/p\u003e\n\u003cp\u003eSQL and general database knowledge\u003c/p\u003e\n\u003cp\u003eComputer Science degree (or relevant industry experience with demonstrable CS fundamentals) and eligibility to work in the United States\u003c/p\u003e\n\u003cp\u003eWHY YOU SHOULD JOIN US:\u003c/p\u003e\n\u003cp\u003eJoin a small, close-knit team with the ability to impact highly visible product already trusted by millions\nGet in early on a small, close-knit team with ownership and impact on products trusted by millions\nAward-winning company culture, strong local leadership, and great career development opportunities\nCompetitive salary plus great perks including equity, full insurance (medical, dental, \u0026amp; vision), unlimited time off, and flexible WFH policies \u003c/p\u003e\n\u003cp\u003eABOUT ONELOGIN\u003c/p\u003e\n\u003cp\u003eOneLogin, the leader in Unified Access Management, connects people with technology through a simple and secure login, empowering organizations to access the world™. The OneLogin Unified Access Management (UAM) platform is the key to unlocking the apps, devices, and data that drive productivity and facilitate collaboration. OneLogin serves businesses and partners across a multitude of industries, with over 2,500 customers worldwide. We are headquartered in San Francisco, California. For more information, visit www.onelogin.com.\u003c/p\u003e\n\u003cp\u003eOur core values\u003c/p\u003e\n\u003cp\u003eSecurity first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind\nCustomer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value\nCollaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team\nAccountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels\nCreative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/a143f6531us\"\u003ehttps://grnh.se/a143f6531us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEdnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a79482b48ee40fe1a3a126c2b7544281d0a46ff0/onelogin%20work%20mark.png"},{"id":"64328a9b-5db9-4d2b-b6b9-f4c7ab42ced0","type":"Full Time","url":"https://jobs.github.com/positions/64328a9b-5db9-4d2b-b6b9-f4c7ab42ced0","created_at":"Mon Apr 12 23:56:25 UTC 2021","company":"OneLogin","company_url":"http://www.onelogin.com","location":"Remote","title":"Lead/Staff Software Engineer, Directories","description":"\u003cp\u003eABOUT THE ROLE\u003c/p\u003e\n\u003cp\u003eHELP US BUILD THE NEXT GENERATION OF CLOUD-BASED IDENTITY AND ACCESS MANAGEMENT (IAM) SOLUTIONS\nMAKE A BIG IMPACT IN A FLEXIBLE WORK ENVIRONMENT WITH A STRONG FOCUS ON PROFESSIONAL DEVELOPMENT\u003c/p\u003e\n\u003cp\u003eOneLogin provides industry-leading enterprise IAM solutions for every user, device and application. We manage and secure millions of identities for thousands of enterprise customers and fortune 500 customers as well.\u003c/p\u003e\n\u003cp\u003eAs part of extending our team, we’re looking for a talented LEAD SOFTWARE ENGINEER with experience in the architecture and development of modern cloud services and on-prem products. In this role, you will be in charge of two main connectors which are responsible for syncing users either from Active Directory or LDAP to OneLogin. You will need to work closely with our support team to provide technical support and answer their questions that they receive everyday from our customers.\u003c/p\u003e\n\u003cp\u003eYou’ll join the team that owns a variety of different functionalities around cloud directories and organizational data.  We have existing systems as well as opportunities to design and implement solutions that provide functionality and scalability beyond any competitors.\u003c/p\u003e\n\u003cp\u003eWHAT YOU’LL BE DOING:\u003c/p\u003e\n\u003cp\u003eRamp and take ownership of existing services in the Active Directory and LDAP area\u003c/p\u003e\n\u003cp\u003eDrive the design and implementation of critical features and improvements\u003c/p\u003e\n\u003cp\u003eFocus on the quality, performance, and security of our existing as well as new platform\u003c/p\u003e\n\u003cp\u003eCollaborate with other engineers and leaders to define the next generation functionality and scalability solutions for cloud directories\u003c/p\u003e\n\u003cp\u003eWork in cross-functional teams to help define and build scenarios across feature areas\u003c/p\u003e\n\u003cp\u003eABOUT YOU:\u003c/p\u003e\n\u003cp\u003eYou value open collaboration, have a strong desire to learn, and are excited to pick up new skills and technologies. You enjoy solving difficult problems, and find creative solutions and understand current patterns and architecture. You’re excited to work closely with people throughout the organization, from close teammates to members of cooperating departments.\u003c/p\u003e\n\u003cp\u003eWHAT YOU BRING TO THE TABLE:\u003c/p\u003e\n\u003cp\u003e5+ years of experience working on backend services, with a background in building and deploying scalable microservices platforms\u003c/p\u003e\n\u003cp\u003e2+ years of customer support experience\u003c/p\u003e\n\u003cp\u003eReviewing code of other senior developers\u003c/p\u003e\n\u003cp\u003eStrong Java, C# (preferred),  NodeJs and/or Ruby experience\u003c/p\u003e\n\u003cp\u003eVery good experience with multi-threading in C# and Java\u003c/p\u003e\n\u003cp\u003eVery good experience with low level http and web-socket programming\u003c/p\u003e\n\u003cp\u003eVery solid experience with any TDD and BDD frameworks, such as NUnit or Puppeteer\u003c/p\u003e\n\u003cp\u003eEnterprise directory experience with Active Directory or LDAP\u003c/p\u003e\n\u003cp\u003eAn understanding of best practices in the design of server-based application with multi-threading mechanisms\u003c/p\u003e\n\u003cp\u003eAbility to provide accurate engineering effort estimates in a dynamic environment\u003c/p\u003e\n\u003cp\u003eExperience troubleshooting in production environments\u003c/p\u003e\n\u003cp\u003eSupport and mentor teammates, encouraging the highest levels of craftsmanship and contribution to engineering and business goals\u003c/p\u003e\n\u003cp\u003eComputer Science degree (or relevant industry experience with demonstrable CS fundamentals) and eligibility to work in the United States or Mexico\u003c/p\u003e\n\u003cp\u003eBonus points for experience with: IAM technologies\u003c/p\u003e\n\u003cp\u003eWHAT’S IN IT FOR YOU:\u003c/p\u003e\n\u003cp\u003eJoin a small, close-knit team with the ability to impact highly visible products already trusted by millions\nAward-winning company culture, strong local leadership, and great career development opportunities\nCompetitive salary plus great perks including equity, full insurance (medical, dental, \u0026amp; vision), unlimited time off, and flexible WFH policies\u003c/p\u003e\n\u003cp\u003eABOUT ONELOGIN\u003c/p\u003e\n\u003cp\u003eOneLogin, the leader in Unified Access Management, connects people with technology through a simple and secure login, empowering organizations to access the world™. The OneLogin Unified Access Management (UAM) platform is the key to unlocking the apps, devices, and data that drive productivity and facilitate collaboration. OneLogin serves businesses and partners across a multitude of industries, with over 2,500 customers worldwide.\u003c/p\u003e\n\u003cp\u003eOur core values\u003c/p\u003e\n\u003cp\u003eSecurity first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind\nCustomer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value\nCollaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team\nAccountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels\nCreative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/6af897351us\"\u003ehttps://grnh.se/6af897351us\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"2fdcf257-3257-450e-ba3d-adc03a6f41aa","type":"Full Time","url":"https://jobs.github.com/positions/2fdcf257-3257-450e-ba3d-adc03a6f41aa","created_at":"Mon Apr 12 17:28:09 UTC 2021","company":"Cased","company_url":"https://cased.com","location":"Remote, US","title":"Backend Engineer","description":"\u003cp\u003eAt Cased, we create innovative solutions and workflows for the growing number of security, compliance, and productivity challenges that face software companies.\u003c/p\u003e\n\u003cp\u003eCased was founded in early 2020 by four former GitHub employees, with investment from Founders Fund and some of the most experienced angel investors in technology. Our product enables growing tech companies to ship fast, while staying secure as they grow. Our product includes features like approval workflows for important operations, automatic logging and recording of DevOps tooling, and integrations that link identity providers to command line tools. And we're just getting started.\u003c/p\u003e\n\u003cp\u003eYou'll help to shape both the future of our product and the company we become. You'll ship world-class software and work alongside engineering, design, and product leaders who helped build GitHub, Facebook, Zillow, Yelp, and Simple.\u003c/p\u003e\n\u003cp\u003eCased embraces diversity, equity and inclusion, and invites applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we're looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years experience writing Ruby on Rails code (or significant experience with a similar framework) and have previously collaborated with others in large codebases.\u003c/li\u003e\n\u003cli\u003eYou're excited about working on a fast-growing product, and can adapt to changing product and customer needs.\u003c/li\u003e\n\u003cli\u003eYou are familiar with good REST API design and best practices including authentication, rate limiting, content encoding, schemas, and errors.\u003c/li\u003e\n\u003cli\u003eSolid database design skills, and some familiarity with search technology is helpful.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you'll do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork alongside Cased founders and engineers to assist in the design, scalability, and implementation of customer-centric features.\u003c/li\u003e\n\u003cli\u003eLearn from customer feedback and weigh in on product decisions.\u003c/li\u003e\n\u003cli\u003eHelp to build a diverse and inclusive company culture. As an early employee you'll have a significant impact on the type of company Cased becomes.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork remotely from anywhere in the United States\u003c/li\u003e\n\u003cli\u003eCompetitive equity and salary\u003c/li\u003e\n\u003cli\u003eMedical, dental, and vision health care coverage\u003c/li\u003e\n\u003cli\u003eA maxed-out MacBook Pro (or equivalent depending on your preference)\u003c/li\u003e\n\u003cli\u003e$1,500 stipend to setup your home office as you see fit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur tech stack right now includes:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRuby on Rails\u003c/li\u003e\n\u003cli\u003eGo\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003eKafka\u003c/li\u003e\n\u003cli\u003eElasticsearch\u003c/li\u003e\n\u003cli\u003eTerraform\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eTo apply, send your resume, GitHub, or LinkedIn profile to \u003ca href=\"mailto:team@cased.com\"\u003eteam@cased.com\u003c/a\u003e, along with a brief note on why you'd like to work at Cased.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2lnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2217bef5c097da7b45e3d2f92692e87cfa4294ce/Frame%2015.png"}]
